STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
/**
  ******************************************************************************
  * @file    stm32mp2xx_hal_ddr.c
  * @author  MCD Application Team
  * @brief   DDR HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Double Data Rate Synchronous Dynamic Random
  *          Access Memory (DDR-SDRAM) Peripheral, through its controller
  *          (DDRCTRL) and its physical interface controller (DDRPHYC).
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
 ===============================================================================
                        ##### How to use this driver #####
 ===============================================================================

  @endverbatim
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#ifdef DDR_INTERACTIVE
#include <ctype.h>
#endif /* DDR_INTERACTIVE */
#include <stdbool.h>
#ifdef DDR_INTERACTIVE
#include <stdlib.h>
#endif /* DDR_INTERACTIVE */
#include <string.h>
#include <stdio.h>
#include "stm32mp2xx_hal.h"

#ifdef HAL_DDR_MODULE_ENABLED

#include "stm32mp2xx_hal_ddr_ddrphy_phyinit.h"

#ifdef DDR_INTERACTIVE
  #include "stm32mp_util_conf.h"
  #include "stm32mp_util_ddr_conf.h"
#else /* DDR_INTERACTIVE */
#if (STM32MP_DDR3_TYPE && (DDR_SIZE_Gb == 8)) && defined(STM32MP_DDR_16_BIT_INTERFACE)
#ifdef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 800)
#include "stm32mp2xx-ddr3-1x8Gbits-1x16bits-800MHz-palladium.h"
#endif /* (DDR_FREQ == 800) */
#endif /* USE_STM32MP257CXX_EMU */
#ifndef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 800)
#include "stm32mp2xx-ddr3-1x8Gbits-1x16bits-800MHz.h"
#endif /* (DDR_FREQ == 800) */
#endif /* !USE_STM32MP257CXX_EMU */
#endif /* (STM32MP_DDR3_TYPE && (DDR_SIZE_Gb == 8)) && defined(STM32MP_DDR_16_BIT_INTERFACE) */

#if (STM32MP_DDR3_TYPE && (DDR_SIZE_Gb == 8)) && !defined(STM32MP_DDR_16_BIT_INTERFACE)
#ifndef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 933)
#include "stm32mp2xx-ddr3-2x4Gbits-2x16bits-933MHz.h"
#endif /* (DDR_FREQ == 933) */
#endif /* !USE_STM32MP257CXX_EMU */
#endif /* (STM32MP_DDR3_TYPE && (DDR_SIZE_Gb == 8)) && !defined(STM32MP_DDR_16_BIT_INTERFACE) */

#if (STM32MP_DDR3_TYPE && (DDR_SIZE_Gb == 16)) && !defined(STM32MP_DDR_16_BIT_INTERFACE)
#ifdef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 933)
#include "stm32mp2xx-ddr3-2x8Gbits-2x16bits-933MHz-palladium.h"
#endif /* (DDR_FREQ == 933) */
#endif /* USE_STM32MP257CXX_EMU */
#endif /* (STM32MP_DDR3_TYPE && (DDR_SIZE_Gb == 16)) && !defined(STM32MP_DDR_16_BIT_INTERFACE) */

#if (STM32MP_DDR4_TYPE && (DDR_SIZE_Gb == 32)) && defined(STM32MP_DDR_16_BIT_INTERFACE)
#ifdef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 800)
#include "stm32mp2xx-ddr4-1x32Gbits-1x16bits-800MHz-palladium.h"
#endif /* (DDR_FREQ == 800) */
#endif /* USE_STM32MP257CXX_EMU */
#ifndef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 800)
#include "stm32mp2xx-ddr4-1x32Gbits-1x16bits-800MHz.h"
#endif /* (DDR_FREQ == 800) */
#endif /* USE_STM32MP257CXX_EMU */
#endif /* (STM32MP_DDR4_TYPE && (DDR_SIZE_Gb == 32)) && defined(STM32MP_DDR_16_BIT_INTERFACE) */

#if (STM32MP_DDR4_TYPE && (DDR_SIZE_Gb == 32)) && !defined(STM32MP_DDR_16_BIT_INTERFACE)
#ifdef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 1200)
#include "stm32mp2xx-ddr4-2x16Gbits-2x16bits-1200MHz-palladium.h"
#endif /* (DDR_FREQ == 1200) */
#endif /* USE_STM32MP257CXX_EMU */
#ifndef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 1200)
#include "stm32mp2xx-ddr4-2x16Gbits-2x16bits-1200MHz.h"
#endif /* (DDR_FREQ == 1200) */
#endif /* !USE_STM32MP257CXX_EMU */
#endif /* (STM32MP_DDR4_TYPE && (DDR_SIZE_Gb == 32)) && !defined(STM32MP_DDR_16_BIT_INTERFACE) */

#if (STM32MP_LPDDR4_TYPE && (DDR_SIZE_Gb == 16)) && defined(STM32MP_DDR_16_BIT_INTERFACE)
#ifdef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 800)
#include "stm32mp2xx-lpddr4-1x16Gbits-1x16bits-800MHz-palladium.h"
#endif /* (DDR_FREQ == 800) */
#endif /* USE_STM32MP257CXX_EMU */
#ifndef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 800)
#include "stm32mp2xx-lpddr4-1x16Gbits-1x16bits-800MHz.h"
#endif /* (DDR_FREQ == 800) */
#if (DDR_FREQ == 1200)
#include "stm32mp2xx-lpddr4-1x16Gbits-1x16bits-1200MHz.h"
#endif /* (DDR_FREQ == 1200) */
#endif /* !USE_STM32MP257CXX_EMU */
#endif /* (STM32MP_LPDDR4_TYPE && (DDR_SIZE_Gb == 16)) && defined(STM32MP_DDR_16_BIT_INTERFACE) */

#if (STM32MP_LPDDR4_TYPE && (DDR_SIZE_Gb == 32)) && !defined(STM32MP_DDR_16_BIT_INTERFACE)
#ifdef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 1200)
#include "stm32mp2xx-lpddr4-1x32Gbits-1x32bits-1200MHz-palladium.h"
#endif /* (DDR_FREQ == 1200) */
#endif /* USE_STM32MP257CXX_EMU */
#ifndef USE_STM32MP257CXX_EMU
#if (DDR_FREQ == 1200)
#include "stm32mp2xx-lpddr4-1x32Gbits-1x32bits-1200MHz.h"
#endif /* (DDR_FREQ == 1200) */
#endif /* !USE_STM32MP257CXX_EMU */
#endif /* (STM32MP_LPDDR4_TYPE && (DDR_SIZE_Gb == 32)) && !defined(STM32MP_DDR_16_BIT_INTERFACE) */
#endif /* DDR_INTERACTIVE */

/** @addtogroup STM32MP2xx_HAL_Driver
  * @{
  */

/** @defgroup DDR DDR
  * @brief HAL DDR module driver
  * @{
  */
#if defined (DDRC) && defined (DDRPHYC)

/* Private typedef -----------------------------------------------------------*/
typedef enum
{
  BASE_DDRCTRL,
  BASE_PHY_UI_BASIC,
  BASE_PHY_UI_ADVANCED,
  BASE_PHY_UI_MODE_REGISTER,
  BASE_PHY_UI_SWIZZLE,
#ifdef DDR_INTERACTIVE
  BASE_DDR_PLL,
#endif /* DDR_INTERACTIVE */
  BASE_NONE
} base_type;

typedef struct
{
  const char *name;
  uint16_t offset; /* Offset for base address */
  uint8_t par_offset; /* Offset for parameter array */
  bool qd; /* quasi-dynamic register if true */
} reg_desc_t;

typedef struct
{
  const char *name;
  const reg_desc_t *desc;
  uint8_t size;
  base_type base;
} ddr_reg_info_t;

