STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
typedef enum
{
  REG_REG,
  REG_TIMING,
  REG_PERF,
  REG_MAP,
  PHY_UI_BASIC,
  PHY_UI_ADVANCED,
  PHY_UI_MODE_REGISTER,
  PHY_UI_SWIZZLE,
#ifdef DDR_INTERACTIVE
/* DDR PLL settings */
  PLL_SETTINGS,
/*
 * dynamic registers => managed in driver or not changed,
 * can be dumped in interactive mode
 */
  REG_DYN,
#endif /* DDR_INTERACTIVE */
  REG_TYPE_NB
} reg_type;

/* Private define ------------------------------------------------------------*/
#define DFLT_SR_MODE HAL_DDR_SW_SELF_REFRESH_MODE
#define INIT_SR_MODE HAL_DDR_AUTO_SELF_REFRESH_MODE
#define MAX_SR_MODE  HAL_DDR_HW_SELF_REFRESH_MODE

#define INVALID_OFFSET 0xFFU

#define DDRCTL_REG(x, y, z) \
  { \
    .name = #x, \
    .offset = offsetof(DDRC_TypeDef, x), \
    .par_offset = offsetof(y, x), \
    .qd = z \
  }

#define DDRCTL_REG_REG(x, z) DDRCTL_REG(x, HAL_DDR_RegTypeDef, z)
static const reg_desc_t ddr_reg_desc[] =
{
  DDRCTL_REG_REG(MSTR, true),
  DDRCTL_REG_REG(MRCTRL0, false),
  DDRCTL_REG_REG(MRCTRL1, false),
  DDRCTL_REG_REG(MRCTRL2, false),
  DDRCTL_REG_REG(DERATEEN, true),
  DDRCTL_REG_REG(DERATEINT, false),
  DDRCTL_REG_REG(DERATECTL, false),
  DDRCTL_REG_REG(PWRCTL, false),
  DDRCTL_REG_REG(PWRTMG, true),
  DDRCTL_REG_REG(HWLPCTL, true),
  DDRCTL_REG_REG(RFSHCTL0, false),
  DDRCTL_REG_REG(RFSHCTL1, false),
  DDRCTL_REG_REG(RFSHCTL3, true),
  DDRCTL_REG_REG(CRCPARCTL0, false),
  DDRCTL_REG_REG(CRCPARCTL1, false),
  DDRCTL_REG_REG(INIT0, true),
  DDRCTL_REG_REG(INIT1, false),
  DDRCTL_REG_REG(INIT2, false),
  DDRCTL_REG_REG(INIT3, true),
  DDRCTL_REG_REG(INIT4, true),
  DDRCTL_REG_REG(INIT5, false),
  DDRCTL_REG_REG(INIT6, true),
  DDRCTL_REG_REG(INIT7, true),
  DDRCTL_REG_REG(DIMMCTL, false),
  DDRCTL_REG_REG(RANKCTL, true),
  DDRCTL_REG_REG(RANKCTL1, true),
  DDRCTL_REG_REG(ZQCTL0, true),
  DDRCTL_REG_REG(ZQCTL1, false),
  DDRCTL_REG_REG(ZQCTL2, false),
  DDRCTL_REG_REG(DFITMG0, true),
  DDRCTL_REG_REG(DFITMG1, true),
  DDRCTL_REG_REG(DFILPCFG0, false),
  DDRCTL_REG_REG(DFILPCFG1, false),
  DDRCTL_REG_REG(DFIUPD0, true),
  DDRCTL_REG_REG(DFIUPD1, false),
  DDRCTL_REG_REG(DFIUPD2, false),
  DDRCTL_REG_REG(DFIMISC, true),
  DDRCTL_REG_REG(DFITMG2, true),
  DDRCTL_REG_REG(DFITMG3, false),
  DDRCTL_REG_REG(DBICTL, true),
  DDRCTL_REG_REG(DFIPHYMSTR, false),
  DDRCTL_REG_REG(DBG0, false),
  DDRCTL_REG_REG(DBG1, false),
  DDRCTL_REG_REG(DBGCMD, false),
  DDRCTL_REG_REG(SWCTL, false), /* forced qd value */
  DDRCTL_REG_REG(SWCTLSTATIC, false),
  DDRCTL_REG_REG(POISONCFG, false),
  DDRCTL_REG_REG(PCCFG, false),
};

#define DDRCTL_REG_TIMING(x, z) DDRCTL_REG(x, HAL_DDR_TimingTypeDef, z)
static const reg_desc_t ddr_timing_desc[] =
{
  DDRCTL_REG_TIMING(RFSHTMG, false),
  DDRCTL_REG_TIMING(RFSHTMG1, false),
  DDRCTL_REG_TIMING(DRAMTMG0, true),
  DDRCTL_REG_TIMING(DRAMTMG1, true),
  DDRCTL_REG_TIMING(DRAMTMG2, true),
  DDRCTL_REG_TIMING(DRAMTMG3, true),
  DDRCTL_REG_TIMING(DRAMTMG4, true),
  DDRCTL_REG_TIMING(DRAMTMG5, true),
  DDRCTL_REG_TIMING(DRAMTMG6, true),
  DDRCTL_REG_TIMING(DRAMTMG7, true),
  DDRCTL_REG_TIMING(DRAMTMG8, true),
  DDRCTL_REG_TIMING(DRAMTMG9, true),
  DDRCTL_REG_TIMING(DRAMTMG10, true),
  DDRCTL_REG_TIMING(DRAMTMG11, true),
  DDRCTL_REG_TIMING(DRAMTMG12, true),
  DDRCTL_REG_TIMING(DRAMTMG13, true),
  DDRCTL_REG_TIMING(DRAMTMG14, true),
  DDRCTL_REG_TIMING(DRAMTMG15, true),
  DDRCTL_REG_TIMING(ODTCFG, true),
  DDRCTL_REG_TIMING(ODTMAP, false),
};

#define DDRCTL_REG_MAP(x) DDRCTL_REG(x, HAL_DDR_MapTypeDef, false)
static const reg_desc_t ddr_map_desc[] =
{
  DDRCTL_REG_MAP(ADDRMAP0),
  DDRCTL_REG_MAP(ADDRMAP1),
  DDRCTL_REG_MAP(ADDRMAP2),
  DDRCTL_REG_MAP(ADDRMAP3),
  DDRCTL_REG_MAP(ADDRMAP4),
  DDRCTL_REG_MAP(ADDRMAP5),
  DDRCTL_REG_MAP(ADDRMAP6),
  DDRCTL_REG_MAP(ADDRMAP7),
  DDRCTL_REG_MAP(ADDRMAP8),
  DDRCTL_REG_MAP(ADDRMAP9),
  DDRCTL_REG_MAP(ADDRMAP10),
  DDRCTL_REG_MAP(ADDRMAP11),
};

#define DDRCTL_REG_PERF(x, z) DDRCTL_REG(x, HAL_DDR_PerfTypeDef, z)
static const reg_desc_t ddr_perf_desc[] =
{
  DDRCTL_REG_PERF(SCHED, true),
  DDRCTL_REG_PERF(SCHED1, false),
  DDRCTL_REG_PERF(PERFHPR1, true),
  DDRCTL_REG_PERF(PERFLPR1, true),
  DDRCTL_REG_PERF(PERFWR1, true),
  DDRCTL_REG_PERF(SCHED3, false),
  DDRCTL_REG_PERF(SCHED4, false),
  DDRCTL_REG_PERF(PCFGR_0, false),
  DDRCTL_REG_PERF(PCFGW_0, false),
  DDRCTL_REG_PERF(PCTRL_0, false),
  DDRCTL_REG_PERF(PCFGQOS0_0, true),
  DDRCTL_REG_PERF(PCFGQOS1_0, true),
  DDRCTL_REG_PERF(PCFGWQOS0_0, true),
  DDRCTL_REG_PERF(PCFGWQOS1_0, true),
#if STM32MP_DDR_DUAL_AXI_PORT
  DDRCTL_REG_PERF(PCFGR_1, false),
  DDRCTL_REG_PERF(PCFGW_1, false),
  DDRCTL_REG_PERF(PCTRL_1, false),
  DDRCTL_REG_PERF(PCFGQOS0_1, true),
  DDRCTL_REG_PERF(PCFGQOS1_1, true),
  DDRCTL_REG_PERF(PCFGWQOS0_1, true),
  DDRCTL_REG_PERF(PCFGWQOS1_1, true),
#endif /* STM32MP_DDR_DUAL_AXI_PORT */
};

#define PHY_UIB_PARAM(x) \
  { \
    .name = "UIB_"#x, \
    .offset = offsetof(user_input_basic_t, x), \
    .par_offset = offsetof(HAL_DDR_BasicUiTypeDef, x) \
  }

#define PHY_UIB_PARAM_INDEX(x, y) \
  { \
    .name = "UIB_"#x"_"#y, \
    .offset = offsetof(user_input_basic_t, x[(y)]), \
    .par_offset = offsetof(HAL_DDR_BasicUiTypeDef, x[(y)]) \
  }

static const reg_desc_t phy_uib_desc[] =
{
  PHY_UIB_PARAM(dramtype),
  PHY_UIB_PARAM(dimmtype),
  PHY_UIB_PARAM(lp4xmode),
  PHY_UIB_PARAM(numdbyte),
  PHY_UIB_PARAM(numactivedbytedfi0),
  PHY_UIB_PARAM(numactivedbytedfi1),
  PHY_UIB_PARAM(numanib),
  PHY_UIB_PARAM(numrank_dfi0),
  PHY_UIB_PARAM(numrank_dfi1),
  PHY_UIB_PARAM(dramdatawidth),
  PHY_UIB_PARAM(numpstates),
  PHY_UIB_PARAM_INDEX(frequency, 0),
  PHY_UIB_PARAM_INDEX(pllbypass, 0),
  PHY_UIB_PARAM_INDEX(dfifreqratio, 0),
  PHY_UIB_PARAM(dfi1exists),
  PHY_UIB_PARAM(train2d),
  PHY_UIB_PARAM(hardmacrover),
  PHY_UIB_PARAM_INDEX(readdbienable, 0),
  PHY_UIB_PARAM(dfimode),
};

#define PHY_UIA_PARAM(x) \
  { \
    .name = "UIA_"#x, \
    .offset = offsetof(user_input_advanced_t, x), \
    .par_offset = offsetof(HAL_DDR_AdvancedUiTypeDef, x) \
  }

#define PHY_UIA_PARAM_INDEX(x, y) \
  { \
    .name = "UIA_"#x"_"#y, \
    .offset = offsetof(user_input_advanced_t, x[(y)]), \
    .par_offset = offsetof(HAL_DDR_AdvancedUiTypeDef, x[(y)]) \
  }

