STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
static const reg_desc_t phy_uia_desc[] =
{
  PHY_UIA_PARAM_INDEX(lp4rxpreamblemode, 0),
  PHY_UIA_PARAM_INDEX(lp4postambleext, 0),
  PHY_UIA_PARAM_INDEX(d4rxpreamblelength, 0),
  PHY_UIA_PARAM_INDEX(d4txpreamblelength, 0),
  PHY_UIA_PARAM(extcalresval),
  PHY_UIA_PARAM_INDEX(is2ttiming, 0),
  PHY_UIA_PARAM_INDEX(odtimpedance, 0),
  PHY_UIA_PARAM_INDEX(tximpedance, 0),
  PHY_UIA_PARAM(atximpedance),
  PHY_UIA_PARAM(memalerten),
  PHY_UIA_PARAM(memalertpuimp),
  PHY_UIA_PARAM(memalertvreflevel),
  PHY_UIA_PARAM(memalertsyncbypass),
  PHY_UIA_PARAM_INDEX(disdynadrtri, 0),
  PHY_UIA_PARAM_INDEX(phymstrtraininterval, 0),
  PHY_UIA_PARAM_INDEX(phymstrmaxreqtoack, 0),
  PHY_UIA_PARAM(wdqsext),
  PHY_UIA_PARAM(calinterval),
  PHY_UIA_PARAM(calonce),
  PHY_UIA_PARAM_INDEX(lp4rl, 0),
  PHY_UIA_PARAM_INDEX(lp4wl, 0),
  PHY_UIA_PARAM_INDEX(lp4wls, 0),
  PHY_UIA_PARAM_INDEX(lp4dbird, 0),
  PHY_UIA_PARAM_INDEX(lp4dbiwr, 0),
  PHY_UIA_PARAM_INDEX(lp4nwr, 0),
  PHY_UIA_PARAM(lp4lowpowerdrv),
  PHY_UIA_PARAM(drambyteswap),
  PHY_UIA_PARAM(rxenbackoff),
  PHY_UIA_PARAM(trainsequencectrl),
  PHY_UIA_PARAM(snpsumctlopt),
  PHY_UIA_PARAM_INDEX(snpsumctlf0rc5x, 0),
  PHY_UIA_PARAM_INDEX(txslewrisedq, 0),
  PHY_UIA_PARAM_INDEX(txslewfalldq, 0),
  PHY_UIA_PARAM(txslewriseac),
  PHY_UIA_PARAM(txslewfallac),
  PHY_UIA_PARAM(disableretraining),
  PHY_UIA_PARAM(disablephyupdate),
  PHY_UIA_PARAM(enablehighclkskewfix),
  PHY_UIA_PARAM(disableunusedaddrlns),
  PHY_UIA_PARAM(phyinitsequencenum),
  PHY_UIA_PARAM(enabledficspolarityfix),
  PHY_UIA_PARAM(phyvref),
  PHY_UIA_PARAM_INDEX(sequencectrl, 0),
};

#define PHY_UIM_PARAM_INDEX(x, y) \
  { \
    .name = "UIM_"#x"_"#y, \
    .offset = offsetof(user_input_mode_register_t, x[(y)]), \
    .par_offset = offsetof(HAL_DDR_ModeRegisterUiTypeDef, x[(y)]) \
  }

static const reg_desc_t phy_uim_desc[] =
{
  PHY_UIM_PARAM_INDEX(mr0, 0),
  PHY_UIM_PARAM_INDEX(mr1, 0),
  PHY_UIM_PARAM_INDEX(mr2, 0),
  PHY_UIM_PARAM_INDEX(mr3, 0),
  PHY_UIM_PARAM_INDEX(mr4, 0),
  PHY_UIM_PARAM_INDEX(mr5, 0),
  PHY_UIM_PARAM_INDEX(mr6, 0),
  PHY_UIM_PARAM_INDEX(mr11, 0),
  PHY_UIM_PARAM_INDEX(mr12, 0),
  PHY_UIM_PARAM_INDEX(mr13, 0),
  PHY_UIM_PARAM_INDEX(mr14, 0),
  PHY_UIM_PARAM_INDEX(mr22, 0),
};

#define PHY_UIS_PARAM_INDEX(x) \
  { \
    .name = "UIS_"#x, \
    .offset = offsetof(user_input_swizzle_t, swizzle[(x)]), \
    .par_offset = offsetof(HAL_DDR_SwizzleUiTypeDef, swizzle[(x)]) \
  }

static const reg_desc_t phy_uis_desc[] =
{
  PHY_UIS_PARAM_INDEX(0),
  PHY_UIS_PARAM_INDEX(1),
  PHY_UIS_PARAM_INDEX(2),
  PHY_UIS_PARAM_INDEX(3),
  PHY_UIS_PARAM_INDEX(4),
  PHY_UIS_PARAM_INDEX(5),
  PHY_UIS_PARAM_INDEX(6),
  PHY_UIS_PARAM_INDEX(7),
  PHY_UIS_PARAM_INDEX(8),
  PHY_UIS_PARAM_INDEX(9),
  PHY_UIS_PARAM_INDEX(10),
  PHY_UIS_PARAM_INDEX(11),
  PHY_UIS_PARAM_INDEX(12),
  PHY_UIS_PARAM_INDEX(13),
  PHY_UIS_PARAM_INDEX(14),
  PHY_UIS_PARAM_INDEX(15),
  PHY_UIS_PARAM_INDEX(16),
  PHY_UIS_PARAM_INDEX(17),
  PHY_UIS_PARAM_INDEX(18),
  PHY_UIS_PARAM_INDEX(19),
  PHY_UIS_PARAM_INDEX(20),
  PHY_UIS_PARAM_INDEX(21),
  PHY_UIS_PARAM_INDEX(22),
  PHY_UIS_PARAM_INDEX(23),
  PHY_UIS_PARAM_INDEX(24),
  PHY_UIS_PARAM_INDEX(25),
  PHY_UIS_PARAM_INDEX(26),
  PHY_UIS_PARAM_INDEX(27),
  PHY_UIS_PARAM_INDEX(28),
  PHY_UIS_PARAM_INDEX(29),
  PHY_UIS_PARAM_INDEX(30),
  PHY_UIS_PARAM_INDEX(31),
  PHY_UIS_PARAM_INDEX(32),
  PHY_UIS_PARAM_INDEX(33),
  PHY_UIS_PARAM_INDEX(34),
  PHY_UIS_PARAM_INDEX(35),
  PHY_UIS_PARAM_INDEX(36),
  PHY_UIS_PARAM_INDEX(37),
  PHY_UIS_PARAM_INDEX(38),
  PHY_UIS_PARAM_INDEX(39),
  PHY_UIS_PARAM_INDEX(40),
  PHY_UIS_PARAM_INDEX(41),
  PHY_UIS_PARAM_INDEX(42),
  PHY_UIS_PARAM_INDEX(43),
};

#ifdef DDR_INTERACTIVE
/*******************************************************************
 * PLL SETTINGS: only used for interactive mode (read/modify param)
 * Print is possible with separate way (edit not possible, use freq)
 *******************************************************************/
#define DDR_PLL_SETTINGS(x) \
  { \
    .name =#x, \
    .offset = INVALID_OFFSET, \
    .par_offset = offsetof(HAL_DDR_PllTypeDef, x) \
  }

static const reg_desc_t pll_settings_desc[] = {
  DDR_PLL_SETTINGS(source),
  DDR_PLL_SETTINGS(mode),
  DDR_PLL_SETTINGS(fbdiv),
  DDR_PLL_SETTINGS(frefdiv),
  DDR_PLL_SETTINGS(fracin),
  DDR_PLL_SETTINGS(postdiv1),
  DDR_PLL_SETTINGS(postdiv2),
  DDR_PLL_SETTINGS(state),
  DDR_PLL_SETTINGS(ssm_mode),
  DDR_PLL_SETTINGS(ssm_spread),
  DDR_PLL_SETTINGS(ssm_divval),
};

/*******************************************************************
 * DYNAMIC REGISTERS: only used for interactive mode (read/modify)
 *******************************************************************/
#define DDRCTL_REG_DYN(x) \
  { \
    .name =#x, \
    .offset = offsetof(DDRC_TypeDef, x), \
    .par_offset = INVALID_OFFSET \
  }

static const reg_desc_t ddr_dyn_desc[] = {
  DDRCTL_REG_DYN(STAT),
  DDRCTL_REG_DYN(MRSTAT),
  DDRCTL_REG_DYN(ZQSTAT),
  DDRCTL_REG_DYN(DFISTAT),
  DDRCTL_REG_DYN(DBGCAM),
  DDRCTL_REG_DYN(DBGSTAT),
  DDRCTL_REG_DYN(SWSTAT),
  DDRCTL_REG_DYN(POISONSTAT),
  DDRCTL_REG_DYN(DERATESTAT),
  DDRCTL_REG_DYN(PSTAT),
};
#endif /* DDR_INTERACTIVE */

#define ARRAY_SIZE(a) (sizeof(a) / sizeof((a)[0]))
static const ddr_reg_info_t ddr_registers[REG_TYPE_NB] =
{
  [REG_REG] = {
    .name = "static",
    .desc = ddr_reg_desc,
    .size = ARRAY_SIZE(ddr_reg_desc),
    .base = BASE_DDRCTRL
  },
  [REG_TIMING] = {
    .name = "timing",
    .desc = ddr_timing_desc,
    .size = ARRAY_SIZE(ddr_timing_desc),
    .base = BASE_DDRCTRL
  },
  [REG_PERF] = {
    .name = "perf",
    .desc = ddr_perf_desc,
    .size = ARRAY_SIZE(ddr_perf_desc),
    .base = BASE_DDRCTRL
  },
  [REG_MAP] = {
    .name = "map",
    .desc = ddr_map_desc,
    .size = ARRAY_SIZE(ddr_map_desc),
    .base = BASE_DDRCTRL
  },
  [PHY_UI_BASIC] = {
    .name = "basic",
    .desc = phy_uib_desc,
    .size = ARRAY_SIZE(phy_uib_desc),
    .base = BASE_PHY_UI_BASIC
  },
  [PHY_UI_ADVANCED] = {
    .name = "advanced",
    .desc = phy_uia_desc,
    .size = ARRAY_SIZE(phy_uia_desc),
    .base = BASE_PHY_UI_ADVANCED
  },
  [PHY_UI_MODE_REGISTER] = {
    .name = "mode_register",
    .desc = phy_uim_desc,
    .size = ARRAY_SIZE(phy_uim_desc),
    .base = BASE_PHY_UI_MODE_REGISTER
  },
  [PHY_UI_SWIZZLE] = {
    .name = "swizzle",
    .desc = phy_uis_desc,
    .size = ARRAY_SIZE(phy_uis_desc),
    .base = BASE_PHY_UI_SWIZZLE
  },
#ifdef DDR_INTERACTIVE
  [PLL_SETTINGS] = {
    .name = "pll",
    .desc = pll_settings_desc,
    .size = ARRAY_SIZE(pll_settings_desc),
    .base = BASE_DDR_PLL
  },
  [REG_DYN] = {
    .name = "dyn",
    .desc = ddr_dyn_desc,
    .size = ARRAY_SIZE(ddr_dyn_desc),
    .base = BASE_DDRCTRL
  },
#endif /* DDR_INTERACTIVE */
};

