STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
#ifdef DDR_INTERACTIVE
const char *base_name[] = {
  [BASE_DDRCTRL] = "ctl",
  [BASE_PHY_UI_BASIC] = "uib",
  [BASE_PHY_UI_ADVANCED] = "uia",
  [BASE_PHY_UI_MODE_REGISTER] = "uim",
  [BASE_PHY_UI_SWIZZLE] = "uis",
  [BASE_DDR_PLL] = "pll",
};
#endif /* DDR_INTERACTIVE */

#ifdef STM32MP_GATHER_DDRCTRL_SETTING_IN_STATIC_ARRAY
const __attribute__((section (".STATIC_PARAMS"))) uint32_t tab_static_param[] =
{
  DDR_MSTR,
  DDR_MRCTRL0,
  DDR_MRCTRL1,
  DDR_MRCTRL2,
  DDR_DERATEEN,
  DDR_DERATEINT,
  DDR_DERATECTL,
  DDR_PWRCTL,
  DDR_PWRTMG,
  DDR_HWLPCTL,
  DDR_RFSHCTL0,
  DDR_RFSHCTL1,
  DDR_RFSHCTL3,
  DDR_CRCPARCTL0,
  DDR_CRCPARCTL1,
  DDR_INIT0,
  DDR_INIT1,
  DDR_INIT2,
  DDR_INIT3,
  DDR_INIT4,
  DDR_INIT5,
  DDR_INIT6,
  DDR_INIT7,
  DDR_DIMMCTL,
  DDR_RANKCTL,
  DDR_RANKCTL1,
  DDR_ZQCTL0,
  DDR_ZQCTL1,
  DDR_ZQCTL2,
  DDR_DFITMG0,
  DDR_DFITMG1,
  DDR_DFILPCFG0,
  DDR_DFILPCFG1,
  DDR_DFIUPD0,
  DDR_DFIUPD1,
  DDR_DFIUPD2,
  DDR_DFIMISC,
  DDR_DFITMG2,
  DDR_DFITMG3,
  DDR_DBICTL,
  DDR_DFIPHYMSTR,
  DDR_DBG0,
  DDR_DBG1,
  DDR_DBGCMD,
  DDR_SWCTL,
  DDR_SWCTLSTATIC,
  DDR_POISONCFG,
  DDR_PCCFG,
  DDR_RFSHTMG,
  DDR_RFSHTMG1,
  DDR_DRAMTMG0,
  DDR_DRAMTMG1,
  DDR_DRAMTMG2,
  DDR_DRAMTMG3,
  DDR_DRAMTMG4,
  DDR_DRAMTMG5,
  DDR_DRAMTMG6,
  DDR_DRAMTMG7,
  DDR_DRAMTMG8,
  DDR_DRAMTMG9,
  DDR_DRAMTMG10,
  DDR_DRAMTMG11,
  DDR_DRAMTMG12,
  DDR_DRAMTMG13,
  DDR_DRAMTMG14,
  DDR_DRAMTMG15,
  DDR_ODTCFG,
  DDR_ODTMAP,
  DDR_ADDRMAP0,
  DDR_ADDRMAP1,
  DDR_ADDRMAP2,
  DDR_ADDRMAP3,
  DDR_ADDRMAP4,
  DDR_ADDRMAP5,
  DDR_ADDRMAP6,
  DDR_ADDRMAP7,
  DDR_ADDRMAP8,
  DDR_ADDRMAP9,
  DDR_ADDRMAP10,
  DDR_ADDRMAP11,
  DDR_SCHED,
  DDR_SCHED1,
  DDR_PERFHPR1,
  DDR_PERFLPR1,
  DDR_PERFWR1,
  DDR_SCHED3,
  DDR_SCHED4,
  DDR_PCFGR_0,
  DDR_PCFGW_0,
  DDR_PCTRL_0,
  DDR_PCFGQOS0_0,
  DDR_PCFGQOS1_0,
  DDR_PCFGWQOS0_0,
  DDR_PCFGWQOS1_0,
#if STM32MP_DDR_DUAL_AXI_PORT
  DDR_PCFGR_1,
  DDR_PCFGW_1,
  DDR_PCTRL_1,
  DDR_PCFGQOS0_1,
  DDR_PCFGQOS1_1,
  DDR_PCFGWQOS0_1,
  DDR_PCFGWQOS1_1,
#endif /* STM32MP_DDR_DUAL_AXI_PORT */
  DDR_UIA_PHYMSTRTRAININTERVAL_0,
};
#endif /* STM32MP_GATHER_DDRCTRL_SETTING_IN_STATIC_ARRAY */

#ifdef __AARCH64__
#define DDR_PATTERN                          0xAAAAAAAAAAAAAAAAU
#define DDR_ANTIPATTERN                      0x5555555555555555U
#else /* __AARCH64__ */
#define DDR_PATTERN                          0xAAAAAAAAU
#define DDR_ANTIPATTERN                      0x55555555U
#endif /* __AARCH64__ */

#define DDR_DELAY_1_US                       1U
#define DDR_TIMEOUT_1_US                     1U
#define DDR_TIMEOUT_500_US                   500U * DDR_TIMEOUT_1_US
#define DDR_TIMEOUT_US_1S                    1000000U * DDR_TIMEOUT_1_US

/* DDRCTRL register fields */
#define DDRC_STAT_OPERATING_MODE_SR       (DDRC_STAT_OPERATING_MODE_0 | \
                                           DDRC_STAT_OPERATING_MODE_1)
#define DDRC_STAT_OPERATING_MODE_NORMAL   DDRC_STAT_OPERATING_MODE_0
#define DDRC_STAT_SELFREF_TYPE_ASR        (DDRC_STAT_SELFREF_TYPE_0 | \
                                           DDRC_STAT_SELFREF_TYPE_1)
#define DDRC_STAT_SELFREF_TYPE_SR         DDRC_STAT_SELFREF_TYPE_1
#define DDRC_STAT_SELFREF_STATE_SRPD      DDRC_STAT_SELFREF_STATE_1
#define DDRC_DBGCAM_DATA_PIPELINE_EMPTY \
  (DDRC_DBGCAM_WR_DATA_PIPELINE_EMPTY | \
  DDRC_DBGCAM_RD_DATA_PIPELINE_EMPTY)
#define DDRC_DBGCAM_Q_AND_DATA_PIPELINE_EMPTY \
  (DDRC_DBGCAM_DBG_WR_Q_EMPTY | \
   DDRC_DBGCAM_DBG_RD_Q_EMPTY | \
   DDRC_DBGCAM_DATA_PIPELINE_EMPTY)

/* DDRPHY registers */
#define DDRPHY_INITENG0_P0_SEQ0BDISABLEFLAG6 0x240004U
#define DDRPHY_INITENG0_P0_PHYINLPX          0x2400A0U
#define DDRPHY_DRTUB0_UCCLKHCLKENABLES       0x300200U
#define DDRPHY_APBONLY0_MICROCONTMUXSEL      0x340000U

/* DDRPHY register fields */
#define DDRPHY_INITENG0_P0_PHYINLPX_PHYINLP3            (1U << 0)
#define DDRPHY_DRTUB0_UCCLKHCLKENABLES_UCCLKEN          (1U << 0)
#define DDRPHY_DRTUB0_UCCLKHCLKENABLES_HCLKEN           (1U << 1)
#define DDRPHY_APBONLY0_MICROCONTMUXSEL_MICROCONTMUXSEL (1U << 0)

/* Other register fields */
#define RCC_DDRITFCFGR_DDRCKMOD_HSR          (0x2UL << 4)

/* HW idle period (unit: Multiples of 32 DFI clock cycles) */
#define HW_IDLE_PERIOD                       0x3U

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
HAL_DDR_SelfRefreshModeTypeDef sr_mode = DFLT_SR_MODE;

HAL_DDR_ConfigTypeDef static_ddr_config =
{
  .info = {
    .name  = DDR_MEM_NAME,
    .speed = DDR_MEM_SPEED,
    .size  = DDR_MEM_SIZE
  },

#ifndef STM32MP_GATHER_DDRCTRL_SETTING_IN_STATIC_ARRAY
  .c_reg = {
    .MSTR       = DDR_MSTR,
    .MRCTRL0    = DDR_MRCTRL0,
    .MRCTRL1    = DDR_MRCTRL1,
    .MRCTRL2    = DDR_MRCTRL2,
    .DERATEEN   = DDR_DERATEEN,
    .DERATEINT  = DDR_DERATEINT,
    .DERATECTL  = DDR_DERATECTL,
    .PWRCTL     = DDR_PWRCTL,
    .PWRTMG     = DDR_PWRTMG,
    .HWLPCTL    = DDR_HWLPCTL,
    .RFSHCTL0   = DDR_RFSHCTL0,
    .RFSHCTL1   = DDR_RFSHCTL1,
    .RFSHCTL3   = DDR_RFSHCTL3,
    .CRCPARCTL0 = DDR_CRCPARCTL0,
    .CRCPARCTL1 = DDR_CRCPARCTL1,
    .INIT0      = DDR_INIT0,
    .INIT1      = DDR_INIT1,
    .INIT2      = DDR_INIT2,
    .INIT3      = DDR_INIT3,
    .INIT4      = DDR_INIT4,
    .INIT5      = DDR_INIT5,
    .INIT6      = DDR_INIT6,
    .INIT7      = DDR_INIT7,
    .DIMMCTL    = DDR_DIMMCTL,
    .RANKCTL    = DDR_RANKCTL,
    .RANKCTL1    = DDR_RANKCTL1,
    .ZQCTL0     = DDR_ZQCTL0,
    .ZQCTL1     = DDR_ZQCTL1,
    .ZQCTL2     = DDR_ZQCTL2,
    .DFITMG0    = DDR_DFITMG0,
    .DFITMG1    = DDR_DFITMG1,
    .DFILPCFG0  = DDR_DFILPCFG0,
    .DFILPCFG1  = DDR_DFILPCFG1,
    .DFIUPD0    = DDR_DFIUPD0,
    .DFIUPD1    = DDR_DFIUPD1,
    .DFIUPD2    = DDR_DFIUPD2,
    .DFIMISC    = DDR_DFIMISC,
    .DFITMG2    = DDR_DFITMG2,
    .DFITMG3    = DDR_DFITMG3,
    .DBICTL     = DDR_DBICTL,
    .DFIPHYMSTR = DDR_DFIPHYMSTR,
    .DBG0       = DDR_DBG0,
    .DBG1       = DDR_DBG1,
    .DBGCMD     = DDR_DBGCMD,
    .SWCTL      = DDR_SWCTL,
    .SWCTLSTATIC = DDR_SWCTLSTATIC,
    .POISONCFG  = DDR_POISONCFG,
    .PCCFG      = DDR_PCCFG
  },

