STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
  .c_timing = {
    .RFSHTMG   = DDR_RFSHTMG,
    .RFSHTMG1  = DDR_RFSHTMG1,
    .DRAMTMG0  = DDR_DRAMTMG0,
    .DRAMTMG1  = DDR_DRAMTMG1,
    .DRAMTMG2  = DDR_DRAMTMG2,
    .DRAMTMG3  = DDR_DRAMTMG3,
    .DRAMTMG4  = DDR_DRAMTMG4,
    .DRAMTMG5  = DDR_DRAMTMG5,
    .DRAMTMG6  = DDR_DRAMTMG6,
    .DRAMTMG7  = DDR_DRAMTMG7,
    .DRAMTMG8  = DDR_DRAMTMG8,
    .DRAMTMG9  = DDR_DRAMTMG9,
    .DRAMTMG10 = DDR_DRAMTMG10,
    .DRAMTMG11 = DDR_DRAMTMG11,
    .DRAMTMG12 = DDR_DRAMTMG12,
    .DRAMTMG13 = DDR_DRAMTMG13,
    .DRAMTMG14 = DDR_DRAMTMG14,
    .DRAMTMG15 = DDR_DRAMTMG15,
    .ODTCFG    = DDR_ODTCFG,
    .ODTMAP    = DDR_ODTMAP
  },

  .c_map = {
    .ADDRMAP0  = DDR_ADDRMAP0,
    .ADDRMAP1  = DDR_ADDRMAP1,
    .ADDRMAP2  = DDR_ADDRMAP2,
    .ADDRMAP3  = DDR_ADDRMAP3,
    .ADDRMAP4  = DDR_ADDRMAP4,
    .ADDRMAP5  = DDR_ADDRMAP5,
    .ADDRMAP6  = DDR_ADDRMAP6,
    .ADDRMAP7  = DDR_ADDRMAP7,
    .ADDRMAP8  = DDR_ADDRMAP8,
    .ADDRMAP9  = DDR_ADDRMAP9,
    .ADDRMAP10 = DDR_ADDRMAP10,
    .ADDRMAP11 = DDR_ADDRMAP11
  },

  .c_perf = {
    .SCHED       = DDR_SCHED,
    .SCHED1      = DDR_SCHED1,
    .PERFHPR1    = DDR_PERFHPR1,
    .PERFLPR1    = DDR_PERFLPR1,
    .PERFWR1     = DDR_PERFWR1,
    .SCHED3      = DDR_SCHED3,
    .SCHED4      = DDR_SCHED4,
    .PCFGR_0     = DDR_PCFGR_0,
    .PCFGW_0     = DDR_PCFGW_0,
    .PCTRL_0     = DDR_PCTRL_0,
    .PCFGQOS0_0  = DDR_PCFGQOS0_0,
    .PCFGQOS1_0  = DDR_PCFGQOS1_0,
    .PCFGWQOS0_0 = DDR_PCFGWQOS0_0,
    .PCFGWQOS1_0 = DDR_PCFGWQOS1_0,
#if STM32MP_DDR_DUAL_AXI_PORT
    .PCFGR_1     = DDR_PCFGR_1,
    .PCFGW_1     = DDR_PCFGW_1,
    .PCTRL_1     = DDR_PCTRL_1,
    .PCFGQOS0_1  = DDR_PCFGQOS0_1,
    .PCFGQOS1_1  = DDR_PCFGQOS1_1,
    .PCFGWQOS0_1 = DDR_PCFGWQOS0_1,
    .PCFGWQOS1_1 = DDR_PCFGWQOS1_1
#endif /* STM32MP_DDR_DUAL_AXI_PORT */
  },
#endif /* !STM32MP_GATHER_DDRCTRL_SETTING_IN_STATIC_ARRAY */

  .p_uib = {
    .dramtype           = DDR_UIB_DRAMTYPE,
    .dimmtype           = DDR_UIB_DIMMTYPE,
    .lp4xmode           = DDR_UIB_LP4XMODE,
    .numdbyte           = DDR_UIB_NUMDBYTE,
    .numactivedbytedfi0 = DDR_UIB_NUMACTIVEDBYTEDFI0,
    .numactivedbytedfi1 = DDR_UIB_NUMACTIVEDBYTEDFI1,
    .numanib            = DDR_UIB_NUMANIB,
    .numrank_dfi0       = DDR_UIB_NUMRANK_DFI0,
    .numrank_dfi1       = DDR_UIB_NUMRANK_DFI1,
    .dramdatawidth      = DDR_UIB_DRAMDATAWIDTH,
    .numpstates         = DDR_UIB_NUMPSTATES,
    .frequency[0]       = DDR_UIB_FREQUENCY_0,
    .pllbypass[0]       = DDR_UIB_PLLBYPASS_0,
    .dfifreqratio[0]    = DDR_UIB_DFIFREQRATIO_0,
    .dfi1exists         = DDR_UIB_DFI1EXISTS,
    .train2d            = DDR_UIB_TRAIN2D,
    .hardmacrover       = DDR_UIB_HARDMACROVER,
    .readdbienable[0]   = DDR_UIB_READDBIENABLE_0,
    .dfimode            = DDR_UIB_DFIMODE
  },

  .p_uia = {
    .lp4rxpreamblemode[0]    = DDR_UIA_LP4RXPREAMBLEMODE_0,
    .lp4postambleext[0]      = DDR_UIA_LP4POSTAMBLEEXT_0,
    .d4rxpreamblelength[0]   = DDR_UIA_D4RXPREAMBLELENGTH_0,
    .d4txpreamblelength[0]   = DDR_UIA_D4TXPREAMBLELENGTH_0,
    .extcalresval            = DDR_UIA_EXTCALRESVAL,
    .is2ttiming[0]           = DDR_UIA_IS2TTIMING_0,
    .odtimpedance[0]         = DDR_UIA_ODTIMPEDANCE_0,
    .tximpedance[0]          = DDR_UIA_TXIMPEDANCE_0,
    .atximpedance            = DDR_UIA_ATXIMPEDANCE,
    .memalerten              = DDR_UIA_MEMALERTEN,
    .memalertpuimp           = DDR_UIA_MEMALERTPUIMP,
    .memalertvreflevel       = DDR_UIA_MEMALERTVREFLEVEL,
    .memalertsyncbypass      = DDR_UIA_MEMALERTSYNCBYPASS,
    .disdynadrtri[0]         = DDR_UIA_DISDYNADRTRI_0,
    .phymstrtraininterval[0] = DDR_UIA_PHYMSTRTRAININTERVAL_0,
    .phymstrmaxreqtoack[0]   = DDR_UIA_PHYMSTRMAXREQTOACK_0,
    .wdqsext                 = DDR_UIA_WDQSEXT,
    .calinterval             = DDR_UIA_CALINTERVAL,
    .calonce                 = DDR_UIA_CALONCE,
    .lp4rl[0]                = DDR_UIA_LP4RL_0,
    .lp4wl[0]                = DDR_UIA_LP4WL_0,
    .lp4wls[0]               = DDR_UIA_LP4WLS_0,
    .lp4dbird[0]             = DDR_UIA_LP4DBIRD_0,
    .lp4dbiwr[0]             = DDR_UIA_LP4DBIWR_0,
    .lp4nwr[0]               = DDR_UIA_LP4NWR_0,
    .lp4lowpowerdrv          = DDR_UIA_LP4LOWPOWERDRV,
    .drambyteswap            = DDR_UIA_DRAMBYTESWAP,
    .rxenbackoff             = DDR_UIA_RXENBACKOFF,
    .trainsequencectrl       = DDR_UIA_TRAINSEQUENCECTRL,
    .snpsumctlopt            = DDR_UIA_SNPSUMCTLOPT,
    .snpsumctlf0rc5x[0]      = DDR_UIA_SNPSUMCTLF0RC5X_0,
    .txslewrisedq[0]         = DDR_UIA_TXSLEWRISEDQ_0,
    .txslewfalldq[0]         = DDR_UIA_TXSLEWFALLDQ_0,
    .txslewriseac            = DDR_UIA_TXSLEWRISEAC,
    .txslewfallac            = DDR_UIA_TXSLEWFALLAC,
    .disableretraining       = DDR_UIA_DISABLERETRAINING,
    .disablephyupdate        = DDR_UIA_DISABLEPHYUPDATE,
    .enablehighclkskewfix    = DDR_UIA_ENABLEHIGHCLKSKEWFIX,
    .disableunusedaddrlns    = DDR_UIA_DISABLEUNUSEDADDRLNS,
    .phyinitsequencenum      = DDR_UIA_PHYINITSEQUENCENUM,
    .enabledficspolarityfix  = DDR_UIA_ENABLEDFICSPOLARITYFIX,
    .phyvref                 = DDR_UIA_PHYVREF,
    .sequencectrl[0]         = DDR_UIA_SEQUENCECTRL_0
  },

  .p_uim = {
    .mr0[0]  = DDR_UIM_MR0_0,
    .mr1[0]  = DDR_UIM_MR1_0,
    .mr2[0]  = DDR_UIM_MR2_0,
    .mr3[0]  = DDR_UIM_MR3_0,
    .mr4[0]  = DDR_UIM_MR4_0,
    .mr5[0]  = DDR_UIM_MR5_0,
    .mr6[0]  = DDR_UIM_MR6_0,
    .mr11[0] = DDR_UIM_MR11_0,
    .mr12[0] = DDR_UIM_MR12_0,
    .mr13[0] = DDR_UIM_MR13_0,
    .mr14[0] = DDR_UIM_MR14_0,
    .mr22[0] = DDR_UIM_MR22_0
  },

  .p_uis = {
    .swizzle[0]  = DDR_UIS_SWIZZLE_0,
    .swizzle[1]  = DDR_UIS_SWIZZLE_1,
    .swizzle[2]  = DDR_UIS_SWIZZLE_2,
    .swizzle[3]  = DDR_UIS_SWIZZLE_3,
    .swizzle[4]  = DDR_UIS_SWIZZLE_4,
    .swizzle[5]  = DDR_UIS_SWIZZLE_5,
    .swizzle[6]  = DDR_UIS_SWIZZLE_6,
    .swizzle[7]  = DDR_UIS_SWIZZLE_7,
    .swizzle[8]  = DDR_UIS_SWIZZLE_8,
    .swizzle[9]  = DDR_UIS_SWIZZLE_9,
    .swizzle[10] = DDR_UIS_SWIZZLE_10,
    .swizzle[11] = DDR_UIS_SWIZZLE_11,
    .swizzle[12] = DDR_UIS_SWIZZLE_12,
    .swizzle[13] = DDR_UIS_SWIZZLE_13,
    .swizzle[14] = DDR_UIS_SWIZZLE_14,
    .swizzle[15] = DDR_UIS_SWIZZLE_15,
    .swizzle[16] = DDR_UIS_SWIZZLE_16,
    .swizzle[17] = DDR_UIS_SWIZZLE_17,
    .swizzle[18] = DDR_UIS_SWIZZLE_18,
    .swizzle[19] = DDR_UIS_SWIZZLE_19,
    .swizzle[20] = DDR_UIS_SWIZZLE_20,
    .swizzle[21] = DDR_UIS_SWIZZLE_21,
    .swizzle[22] = DDR_UIS_SWIZZLE_22,
    .swizzle[23] = DDR_UIS_SWIZZLE_23,
    .swizzle[24] = DDR_UIS_SWIZZLE_24,
    .swizzle[25] = DDR_UIS_SWIZZLE_25,
    .swizzle[26] = DDR_UIS_SWIZZLE_26,
    .swizzle[27] = DDR_UIS_SWIZZLE_27,
    .swizzle[28] = DDR_UIS_SWIZZLE_28,
    .swizzle[29] = DDR_UIS_SWIZZLE_29,
    .swizzle[30] = DDR_UIS_SWIZZLE_30,
    .swizzle[31] = DDR_UIS_SWIZZLE_31,
    .swizzle[32] = DDR_UIS_SWIZZLE_32,
    .swizzle[33] = DDR_UIS_SWIZZLE_33,
    .swizzle[34] = DDR_UIS_SWIZZLE_34,
    .swizzle[35] = DDR_UIS_SWIZZLE_35,
    .swizzle[36] = DDR_UIS_SWIZZLE_36,
    .swizzle[37] = DDR_UIS_SWIZZLE_37,
    .swizzle[38] = DDR_UIS_SWIZZLE_38,
    .swizzle[39] = DDR_UIS_SWIZZLE_39,
    .swizzle[40] = DDR_UIS_SWIZZLE_40,
    .swizzle[41] = DDR_UIS_SWIZZLE_41,
    .swizzle[42] = DDR_UIS_SWIZZLE_42,
    .swizzle[43] = DDR_UIS_SWIZZLE_43
  },

