STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
#ifdef DDR_INTERACTIVE
  .p_pll = {
    .source     = DDR_PLL_SOURCE,
    .mode       = DDR_PLL_MODE,
    .fbdiv      = DDR_PLL_FBDIV,
    .frefdiv    = DDR_PLL_FREFDIV,
    .fracin     = DDR_PLL_FRACIN,
    .postdiv1   = DDR_PLL_POSTDIV1,
    .postdiv2   = DDR_PLL_POSTDIV2,
    .state      = DDR_PLL_STATE,
    .ssm_mode   = DDR_PLL_SSM_MODE,
    .ssm_spread = DDR_PLL_SSM_SPREAD,
    .ssm_divval = DDR_PLL_SSM_DIVVAL
  },
#endif /* DDR_INTERACTIVE */
};

static bool axi_port_reenable_request;
static bool host_interface_reenable_request;

/* Private function prototypes -----------------------------------------------*/

/**
  * @brief  Board specific DDR power initialization (weak here)
  * @param  type DDR type (unused here)
  * @retval 0 if success
  */
__weak int32_t HAL_DDR_MspInit(__unused ddr_type type)
{
  return 0;
}

/**
  * @brief  This function tests a simple read/write access to the DDR.
  *         Note that the previous content is restored after test.
  * @param  None
  * @retval 0 if success, and address value else
  */
static uintptr_t ddr_test_rw_access(void)
{
  uintptr_t saved_value = *(uintptr_t *)DDR_MEM_BASE;
  uintptr_t *addr = (uintptr_t *)DDR_MEM_BASE;

  *addr = DDR_PATTERN;

  if (*addr != DDR_PATTERN)
  {
    return (uintptr_t)addr;
  }

  *addr = saved_value;

  return 0UL;
}

/**
  * @brief  This function tests the DDR data bus wiring.
  *         This is inspired from the Data Bus Test algorithm written by Michael Barr
  *         in "Programming Embedded Systems in C and C++" book.
  *         resources.oreilly.com/examples/9781565923546/blob/master/Chapter6/
  *         File: memtest.c - This source code belongs to Public Domain.
  * @param  None
  * @retval 0 if success, and address value else
  */
static uintptr_t ddr_test_data_bus(void)
{
  uint32_t i;
  uintptr_t pattern;
  uintptr_t *addr = (uintptr_t *)DDR_MEM_BASE;

  for (i = 0U; i < 64U; i++)
  {
    pattern = 1 << i;

    *addr = pattern;

    if (*addr != pattern)
    {
      return (uintptr_t)addr;
    }
  }

  return 0UL;
}

/**
  * @brief  This function tests the DDR address bus wiring.
  *         This is inspired from the Data Bus Test algorithm written by Michael Barr
  *         in "Programming Embedded Systems in C and C++" book.
  *         resources.oreilly.com/examples/9781565923546/blob/master/Chapter6/
  *         File: memtest.c - This source code belongs to Public Domain.
  * @param  None
  * @retval 0 if success, and address value else
  */
static uintptr_t ddr_test_addr_bus(void)
{
  uintptr_t addressmask = (static_ddr_config.info.size - 1U);
  uintptr_t offset;
  uintptr_t testoffset = 0UL;
  uintptr_t *addr = (uintptr_t *)DDR_MEM_BASE;
  uintptr_t ret = 0UL;

  /* Write the default pattern at each of the power-of-two offsets. */
  for (offset = sizeof(uintptr_t); offset < addressmask; offset <<= 1)
  {
    *(addr + (offset / sizeof(uintptr_t))) = DDR_PATTERN;
  }

  /* Check for address bits stuck high. */
  *(addr + testoffset) = DDR_ANTIPATTERN;

  for (offset = sizeof(uintptr_t); offset < addressmask; offset <<= 1)
  {
    if (*(addr + (offset / sizeof(uintptr_t))) != DDR_PATTERN)
    {
      return (uintptr_t)(addr + offset / sizeof(uintptr_t));
    }
  }

  *(addr + testoffset) = DDR_PATTERN;

  /* Check for address bits stuck low or shorted. */
  for (testoffset = sizeof(uintptr_t); testoffset < addressmask;
       testoffset <<= 1)
  {
    *(addr + (testoffset / sizeof(uintptr_t))) = DDR_ANTIPATTERN;

    if (*addr != DDR_PATTERN)
    {
      return (uintptr_t)addr;
    }

    for (offset = sizeof(uintptr_t); offset < addressmask; offset <<= 1)
    {
      if ((*(addr + (offset / sizeof(uintptr_t))) != DDR_PATTERN) &&
          (offset != testoffset))
      {
        return (uintptr_t)(addr + (offset / sizeof(uintptr_t)));
      }
    }

    *(addr + (testoffset / sizeof(uintptr_t))) = DDR_PATTERN;
  }

  return ret;
}

/**
  * @brief  This function checks the DDR size. It has to be run with Data Cache off.
  *         This test is run before data have been put in DDR, and is only done for
  *         cold boot. The DDR data can then be overwritten, and it is not useful to
  *         restore its content.
  * @param  None
  * @retval DDR computed size
  */
static uintptr_t ddr_check_size(void)
{
  uintptr_t offset = sizeof(uintptr_t);
  uintptr_t *addr = (uintptr_t *)DDR_MEM_BASE;

  *addr = DDR_PATTERN;

  while (offset < static_ddr_config.info.size)
  {
    *(addr + (offset / sizeof(uintptr_t))) = DDR_ANTIPATTERN;
    __DSB();

    if (*addr != DDR_PATTERN)
    {
      break;
    }

    offset <<= 1;
  }

  return offset;
}

/**
  * @brief  Wait a delay expressed in us
  * @param  delay_us delay in us
  * @retval None
  */
static void ddr_delay_us(uint32_t delay_us)
{
  __IO uint32_t wait_loop_index = 0U;

  wait_loop_index = (delay_us * (SystemCoreClock / (1000000UL * 2UL)));

#ifdef USE_STM32MP257CXX_EMU
  wait_loop_index *= 10U;
#endif /* USE_STM32MP257CXX_EMU */

  while (wait_loop_index != 0UL)
  {
    wait_loop_index--;
  }
}

/**
  * @brief  Initialize DDR timeout in us
  * @param  timeout_us timeout in us
  * @retval wait_loop_index
  */
static __IO uint32_t ddr_timeout_init_us(uint32_t timeout_us)
{
  __IO uint32_t wait_loop_index = 0U;

  wait_loop_index = timeout_us * (SystemCoreClock / (1000000UL * 2UL));

#ifdef USE_STM32MP257CXX_EMU
  wait_loop_index *= 10U;
#endif /* USE_STM32MP257CXX_EMU */

  return wait_loop_index;
}

/**
  * @brief  Check if timeout has expired
  * @param  timeout timeout in us
  * @retval Timeout status
  */
static bool ddr_timeout_elapsed(__IO uint32_t timeout)
{
  if (timeout == 0U)
  {
    return true;
  }

  return false;
}

/**
  * @brief  Start quasi dynamic register update
  * @param  None
  * @retval None
  */
static void start_sw_done(void)
{
  CLEAR_BIT(DDRC->SWCTL, DDRC_SWCTL_SW_DONE);
}

/**
  * @brief  Wait quasi dynamic register update
  * @param  None
  * @retval 0 if success, -1 if timeout
  */
static int32_t wait_sw_done_ack(void)
{
  uint32_t swstat;
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_1_US);

  SET_BIT(DDRC->SWCTL, DDRC_SWCTL_SW_DONE);

  do
  {
    swstat = READ_REG(DDRC->SWSTAT);

