STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      /* Timeout initialising DRAM */
      return -1;
    }
  }
  while ((swstat & DDRC_SWSTAT_SW_DONE_ACK) == 0U);

  return 0;
}

/**
  * @brief  Enable AXI ports
  * @param  None
  * @retval None
  */
static void enable_axi_port(void)
{
  /* Enable uMCTL2 AXI port 0 */
  SET_BIT(DDRC->PCTRL_0, DDRC_PCTRL_0_PORT_EN);

#if STM32MP_DDR_DUAL_AXI_PORT
  /* Enable uMCTL2 AXI port 1 */
  SET_BIT(DDRC->PCTRL_1, DDRC_PCTRL_1_PORT_EN);
#endif /* STM32MP_DDR_DUAL_AXI_PORT */
}

/**
  * @brief  Disable AXI ports
  * @param  None
  * @retval 0 if success, -1 if timeout
  */
static int32_t disable_axi_port(void)
{
  __IO uint32_t timeout;

  /* Disable uMCTL2 AXI port 0 */
  CLEAR_BIT(DDRC->PCTRL_0, DDRC_PCTRL_0_PORT_EN);
#ifdef STM32MP_DDR_DUAL_AXI_PORT
  /* Disable uMCTL2 AXI port 1 */
  CLEAR_BIT(DDRC->PCTRL_1, DDRC_PCTRL_0_PORT_EN);
#endif /* STM32MP_DDR_DUAL_AXI_PORT */

  /*
   * Waits unit all AXI ports are idle
   * Poll PSTAT.rd_port_busy_n = 0
   * Poll PSTAT.wr_port_busy_n = 0
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_US_1S);
  while (READ_REG(DDRC->PSTAT) != 0U)
  {
    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
  }

  return 0;
}

/**
  * @brief  Check if AXI ports are enabled.
  *         Only port 0 is checked, as always used.
  * @param  None
  * @retval true if enabled, false if not
  */
static bool ddr_is_axi_port_enabled(void)
{
  return (READ_REG(DDRC->PCTRL_0) & DDRC_PCTRL_0_PORT_EN) != 0U;
}

/**
  * @brief  Enable host interface
  * @param  None
  * @retval None
  */
static void enable_host_interface(void)
{
  CLEAR_BIT(DDRC->DBG1, DDRC_DBG1_DIS_HIF);
}

/**
  * @brief  Disable host interface
  * @param  None
  * @retval 0 if success, -1 if timeout
  */
static int32_t disable_host_interface(void)
{
  __IO uint32_t timeout;
  uint32_t dbgcam;
  uint32_t count = 0U;

  SET_BIT(DDRC->DBG1, DDRC_DBG1_DIS_HIF);

  /*
   * Waits until all queues and pipelines are empty
   * Poll DBGCAM.dbg_wr_q_empty = 1
   * Poll DBGCAM.dbg_rd_q_empty = 1
   * Poll DBGCAM.dbg_wr_data_pipeline_empty = 1
   * Poll DBGCAM.dbg_rd_data_pipeline_empty = 1
   *
   * data_pipeline fields must be polled twice to ensure
   * value propoagation, so count is added to loop condition.
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_US_1S);
  do
  {
    dbgcam = READ_REG(DDRC->DBGCAM);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }

    count++;
  } while (((dbgcam & DDRC_DBGCAM_Q_AND_DATA_PIPELINE_EMPTY) !=
            DDRC_DBGCAM_Q_AND_DATA_PIPELINE_EMPTY) || (count < 2U));

  return 0;
}

/**
  * @brief  Check if host interface is enabled.
  * @param  None
  * @retval true if enabled, false if not
  */
static bool ddr_is_host_interface_enabled(void)
{
  return (READ_REG(DDRC->DBG1) & DDRC_DBG1_DIS_HIF) == 0U;
}

/**
  * @brief  Software self refresh entry function
  * @param  None
  * @retval 0 if success, -1 if timeout
  */
static int32_t sw_selfref_entry(void)
{
  __IO uint32_t timeout;
  uint32_t stat;
  uint32_t operating_mode;
  uint32_t selref_type;

  /* SW Self-Refresh entry */
  SET_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_SW);

  /*
   * Wait operating mode change in self-refresh mode
   * with STAT.operating_mode[1:0]==11.
   * Ensure transition to self-refresh was due to software
   * by checking also that STAT.selfref_type[1:0]=2.
   */
  timeout = ddr_timeout_init_us(DDR_TIMEOUT_500_US);

  while (!ddr_timeout_elapsed(timeout))
  {
    stat = READ_REG(DDRC->STAT);
    operating_mode = stat & DDRC_STAT_OPERATING_MODE_Msk;
    selref_type = stat & DDRC_STAT_SELFREF_TYPE_Msk;
    timeout--;

    if ((operating_mode == DDRC_STAT_OPERATING_MODE_SR)
        && (selref_type == DDRC_STAT_SELFREF_TYPE_SR))
    {
      return 0;
    }
  }

  return -1;
}

/**
  * @brief  Software self refresh exit function
  * @param  None
  * @retval None
  */
static void sw_selfref_exit(void)
{
  CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_SW);
}

/**
  * @brief  Set conditions for quasi dynamic group 3 register update
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t set_qd3_update_conditions(void)
{
  if (ddr_is_axi_port_enabled())
  {
    if (disable_axi_port() != 0)
    {
      return -1;
    }

    axi_port_reenable_request = true;
  }

  if (ddr_is_host_interface_enabled())
  {
    if (disable_host_interface() != 0)
    {
      return -1;
    }

    host_interface_reenable_request = true;
  }

  start_sw_done();

  return 0;
}

/**
  * @brief  Set conditions for quasi dynamic groups 1 and 3 register update
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t set_qd1_qd3_update_conditions(void)
{
  SET_BIT(DDRC->DBG1, DDRC_DBG1_DIS_DQ);

  return set_qd3_update_conditions();
}

/**
  * @brief  Unset conditions for quasi dynamic group 3 register update
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t unset_qd3_update_conditions(void)
{
  if (wait_sw_done_ack() != 0)
  {
    return -1;
  }

  if (host_interface_reenable_request)
  {
    enable_host_interface();
    host_interface_reenable_request = false;
  }

  if (axi_port_reenable_request)
  {
    enable_axi_port();
    axi_port_reenable_request = false;
  }

  return 0;
}

/**
  * @brief  Unset conditions for quasi dynamic groups 1 and 3 register update
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t unset_qd1_qd3_update_conditions(void)
{
  int32_t ret = unset_qd3_update_conditions();

  if (ret == 0)
  {
      CLEAR_BIT(DDRC->DBG1, DDRC_DBG1_DIS_DQ);
  }

  return ret;
}

/**
  * @brief  Waits for DFI init completion
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t wait_dfi_init_complete(void)
{
  __IO uint32_t timeout;
  uint32_t dfistat;

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_US_1S);
  do
  {
    dfistat = READ_REG(DDRC->DFISTAT);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
  } while ((dfistat & DDRC_DFISTAT_DFI_INIT_COMPLETE) == 0U);

