STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
  return 0;
}

/**
  * @brief  Disables DFI low power interface
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t disable_dfi_low_power_interface(void)
{
  __IO uint32_t timeout;
  uint32_t dfistat;
  uint32_t stat;

  CLEAR_BIT(DDRC->DFILPCFG0, DDRC_DFILPCFG0_DFI_LP_EN_SR);

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_US_1S);
  do
  {
    dfistat = READ_REG(DDRC->DFISTAT);
    stat = READ_REG(DDRC->STAT);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
  } while (((dfistat & DDRC_DFISTAT_DFI_LP_ACK) != 0U) ||
           ((stat & DDRC_STAT_OPERATING_MODE) == DDRC_STAT_OPERATING_MODE_SR));

  return 0;
}

/**
  * @brief  Acitivates DDR controller
  * @param  sr_entry indicates if self refresh entry sequence in progress
  * @retval 0 if success, error code else
  */
static int32_t activate_controller(bool sr_entry)
{
  if (set_qd1_qd3_update_conditions() != 0)
  {
    return -1;
  }

  if (sr_entry)
  {
    SET_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_FREQUENCY);
  }
  else
  {
    CLEAR_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_FREQUENCY);
  }

  SET_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_INIT_START);
  CLEAR_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_INIT_START);

  if (wait_dfi_init_complete() != 0)
  {
    return -1;
  }

  ddr_delay_us(DDR_DELAY_1_US);

  if (sr_entry)
  {
    CLEAR_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_INIT_COMPLETE_EN);
  }
  else
  {
    SET_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_INIT_COMPLETE_EN);
  }

  ddr_delay_us(DDR_DELAY_1_US);

  if (unset_qd1_qd3_update_conditions() != 0)
  {
    return -1;
  }

  return 0;
}

/**
  * @brief  Waits deepest low power mode LP3 entry or exit
  * @param  state expected state
  * @retval 0 if success, error code else
  */
static int32_t wait_lp3_mode(bool state)
{
  __IO uint32_t timeout;
  uint16_t phyinlpx;
  bool repeat_loop = false;

  /* Enable APB access to internal CSR registers */
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_APBONLY0_MICROCONTMUXSEL), 0U);
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_DRTUB0_UCCLKHCLKENABLES),
            DDRPHY_DRTUB0_UCCLKHCLKENABLES_UCCLKEN | DDRPHY_DRTUB0_UCCLKHCLKENABLES_HCLKEN);

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_US_1S);
  do
  {
    phyinlpx = READ_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_INITENG0_P0_PHYINLPX));

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }

    if (state)
    {
      repeat_loop = (phyinlpx & DDRPHY_INITENG0_P0_PHYINLPX_PHYINLP3) == 0U;
    }
    else
    {
      repeat_loop = ((phyinlpx & DDRPHY_INITENG0_P0_PHYINLPX_PHYINLP3) != 0U);
    }
  } while (repeat_loop);

  /* Disable APB access to internal CSR registers */
#if STM32MP_DDR3_TYPE || STM32MP_DDR4_TYPE
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_DRTUB0_UCCLKHCLKENABLES), 0U);
#elif STM32MP_LPDDR4_TYPE
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_DRTUB0_UCCLKHCLKENABLES),
            DDRPHY_DRTUB0_UCCLKHCLKENABLES_HCLKEN);
#endif /* STM32MP_LPDDR4_TYPE */
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_APBONLY0_MICROCONTMUXSEL),
            DDRPHY_APBONLY0_MICROCONTMUXSEL_MICROCONTMUXSEL);

  return 0;
}

#if STM32MP_LPDDR4_TYPE
/**
  * @brief  Disables DDR drift compensation
  * @param  None
  * @retval None
  */
static void disable_phy_ddc(void)
{
  /* Enable APB access to internal CSR registers */
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_APBONLY0_MICROCONTMUXSEL), 0U);
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_DRTUB0_UCCLKHCLKENABLES),
            DDRPHY_DRTUB0_UCCLKHCLKENABLES_UCCLKEN | DDRPHY_DRTUB0_UCCLKHCLKENABLES_HCLKEN);

  /* Disable DRAM drift compensation */
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_INITENG0_P0_SEQ0BDISABLEFLAG6),
            0xFFFFU);

  /* Disable APB access to internal CSR registers */
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_DRTUB0_UCCLKHCLKENABLES),
            DDRPHY_DRTUB0_UCCLKHCLKENABLES_HCLKEN);
  WRITE_REG(*(volatile uint32_t *)(DDRPHYC_BASE + DDRPHY_APBONLY0_MICROCONTMUXSEL),
            DDRPHY_APBONLY0_MICROCONTMUXSEL_MICROCONTMUXSEL);
}
#endif /* STM32MP_LPDDR4_TYPE */

/**
  * @brief  Get register or setting base address
  * @param  type register or setting type
  * @retval Base address
  */
static void *get_base_addr(base_type type)
{
  void *ptr;

  switch (type)
  {
    case BASE_DDRCTRL:
      ptr = (void *)DDRC_BASE;
      break;
    case BASE_PHY_UI_BASIC:
      ptr = ddrphy_get_ui_basic_base();
      break;
    case BASE_PHY_UI_ADVANCED:
      ptr = ddrphy_get_ui_advanced_base();
      break;
    case BASE_PHY_UI_MODE_REGISTER:
      ptr = ddrphy_get_ui_mode_register_base();
      break;
    case BASE_PHY_UI_SWIZZLE:
      ptr = ddrphy_get_ui_swizzle_base();
      break;
    default:
      ptr = (void *)0U;
      break;
  }

  return ptr;
}

/**
  * @brief  Writes a list of register or settings
  * @param  type  register or setting type
  *         param pointer to source content
  * @retval 0 if success, error code else
  */
static int32_t set_reg(reg_type type, uintptr_t param)
{
  uint8_t i;
  void *base_addr = get_base_addr(ddr_registers[type].base);
  const reg_desc_t *desc = ddr_registers[type].desc;

  if (base_addr == (void *)0U)
  {
    return -1;
  }

  for (i = 0U; i < ddr_registers[type].size; i++)
  {
    if (desc[i].par_offset == INVALID_OFFSET)
    {
      return -1;
    }
    else
    {
      uintptr_t address = param + (uintptr_t)desc[i].par_offset;
      uint32_t *ptr = (uint32_t *)address;

      if (base_addr == (void *)DDRC_BASE)
      {
        if (desc[i].qd)
        {
          start_sw_done();
        }

      WRITE_REG(*(volatile uint32_t *)(base_addr + (uint32_t)desc[i].offset),
                *ptr);

        if (desc[i].qd)
        {
          if (wait_sw_done_ack() != 0)
          {
            /* wait_sw_done_ack timeout for offset */
            return -1;
          }
        }
      }
      else
      {
        *(int32_t *)(base_addr + (uint32_t)desc[i].offset) = (int32_t)*ptr;
      }
    }
  }

