STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
  return 0;
}

/**
  * @brief  Generic waiting function for self-refresh entry/exit
  * @param  is_entry transition (self-refresh entry or exit)
  * @retval 0 if success, error code else
  */
static int32_t sr_loop(bool is_entry)
{
  uint32_t type;
#if STM32MP_LPDDR4_TYPE
  uint32_t state;
#endif /* STM32MP_LPDDR4_TYPE */
  __IO uint32_t timeout = ddr_timeout_init_us(DDR_TIMEOUT_1_US);
  bool repeat_loop = false;

  /* Wait for DDRCTRL to be out of or back to "normal/mission mode" */
  do
  {
    type = READ_REG(DDRC->STAT) & DDRC_STAT_SELFREF_TYPE_Msk;
#if STM32MP_LPDDR4_TYPE
    state = READ_REG(DDRC->STAT) & DDRC_STAT_SELFREF_STATE_Msk;
#endif /* STM32MP_LPDDR4_TYPE */

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }

    if (is_entry)
    {
#if STM32MP_LPDDR4_TYPE
      repeat_loop = (type == 0x0U) || (state != DDRC_STAT_SELFREF_STATE_SRPD);
#else /* STM32MP_LPDDR4_TYPE */
      repeat_loop = (type == 0x0U);
#endif /* STM32MP_LPDDR4_TYPE */
    }
    else
    {
#if STM32MP_LPDDR4_TYPE
      repeat_loop = (type != 0x0U) || (state != 0x0U);
#else /* STM32MP_LPDDR4_TYPE */
      repeat_loop = (type != 0x0U);
#endif /* STM32MP_LPDDR4_TYPE */
    }
  } while (repeat_loop);

  return 0;
}

/**
  * @brief  Waiting function for self-refresh entry
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_entry_loop(void)
{
  return sr_loop(true);
}

/**
  * @brief  Waiting function for self-refresh exit
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_exit_loop(void)
{
  return sr_loop(false);
}

/**
  * @brief  Software self-refresh entry for all modes
  * @param  standby low power mode (standby or stop mode)
  * @retval 0 if success, error code else
  */
static int32_t ssr_entry(bool standby)
{
  if (disable_axi_port() != 0)
  {
    return -1;
  }

#if STM32MP_LPDDR4_TYPE
  if (standby)
  {
    /* Disable DRAM drift compensation */
    disable_phy_ddc();
  }
#endif /* STM32MP_LPDDR4_TYPE */

  if (disable_dfi_low_power_interface() != 0)
  {
    return -1;
  }

  /* SW self refresh entry prequested */
  SET_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_SW);
#if STM32MP_LPDDR4_TYPE
  CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_STAY_IN_SELFREF);
#endif /* STM32MP_LPDDR4_TYPE */

  if (sr_entry_loop() != 0)
  {
    return -1;
  }

  if (activate_controller(true) != 0)
  {
    return -1;
  }

  /* Poll on ddrphy_initeng0_phyinlpx.phyinlp3 = 1 */
  if (wait_lp3_mode(true) != 0)
  {
    return -1;
  }

  if (standby)
  {
    /* Enable IO retention */
    CLEAR_BIT(PWR->CR11, PWR_CR11_DDRRETDIS);
  }

  SET_BIT(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN);
  CLEAR_BIT(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPLPEN);
  SET_BIT(RCC->DDRPHYCCFGR, RCC_DDRPHYCCFGR_DDRPHYCEN);
  SET_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRPHYDLP);

  return 0;
}

/**
  * @brief  Software self-refresh entry for stop mode
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_ssr_entry(void)
{
  return ssr_entry(false);
}

/**
  * @brief  Software self-refresh entry for standby mode
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t stdby_sr_ssr_entry(void)
{
  return ssr_entry(true);
}

/**
  * @brief  Software self-refresh exit
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_ssr_exit(void)
{
  SET_BIT(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN | RCC_DDRCPCFGR_DDRCPLPEN);

  CLEAR_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRPHYDLP);
  SET_BIT(RCC->DDRPHYCCFGR, RCC_DDRPHYCCFGR_DDRPHYCEN);

  ddr_delay_us(DDR_DELAY_1_US);

  if (activate_controller(false) != 0)
  {
    return -1;
  }

  /* Poll on ddrphy_initeng0_phyinlpx.phyinlp3 = 0 */
  if (wait_lp3_mode(false) != 0)
  {
    return -1;
  }

  /* SW self refresh entry prequested */
  CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_SW);

  if (sr_exit_loop() != 0)
  {
    return -1;
  }

  /* Re-enable DFI low-power interface */
  SET_BIT(DDRC->DFILPCFG0, DDRC_DFILPCFG0_DFI_LP_EN_SR);

  enable_axi_port();

  return 0;
}

/**
  * @brief  Set software self-refresh mode
  * @param  None
  * @retval 0
  */
static int32_t sr_ssr_set(void)
{
  /*
   * Disable Clock disable with LP modes
   * (used in RUN mode for LPDDR2 with specific timing).
   */
  CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE);

  /* Disable automatic Self-Refresh mode */
  CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_EN);

  WRITE_REG(DDRDBG->LP_DISABLE,
            DDRDBG_LP_DISABLE_LPI_XPI_DISABLE | DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE);

  return 0;
}

/**
  * @brief  Automatic self-refresh entry for all modes
  * @param  standby low power mode (standby or stop mode)
  * @retval 0 if success, error code else
  */
static int32_t asr_entry(__unused bool standby)
{
  /*
   * Automatically enter into self refresh when there is no ddr traffic
   * for the delay programmed into SYSCONF_DDRC_AUTO_SR_DELAY register.
   * Default value is 0x20 (unit: Multiples of 32 DFI clock cycles).
   */
  return sr_entry_loop();
}

/**
  * @brief  Automatic self-refresh entry for stop mode
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_asr_entry(void)
{
  return asr_entry(false);
}

/**
  * @brief  Automatic self-refresh entry for standby mode
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t stdby_sr_asr_entry(void)
{
  return asr_entry(true);
}

/**
  * @brief  Automatic self-refresh exit
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_asr_exit(void)
{
   return sr_exit_loop();
}

/**
  * @brief  Set automatic self-refresh mode
  * @param  None
  * @retval 0
  */
static int32_t sr_asr_set(void)
{
  WRITE_REG(DDRDBG->LP_DISABLE, 0U);

  return 0;
}

/**
  * @brief  Hardware self-refresh entry for all modes
  * @param  standby low power mode (standby or stop mode)
  * @retval 0 if success, error code else
  */
static int32_t hsr_entry(__unused bool standby)
{
  WRITE_REG(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPLPEN);

