STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
  return sr_entry_loop(); /* read_data should be equal to 0x223 */
}

/**
  * @brief  Hardware self-refresh entry for stop mode
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_hsr_entry(void)
{
  return hsr_entry(false);
}

/**
  * @brief  Hardware self-refresh entry for standby mode
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t stdby_sr_hsr_entry(void)
{
  return hsr_entry(true);
}

/**
  * @brief  Hardware self-refresh exit
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_hsr_exit(void)
{
  WRITE_REG(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPLPEN | RCC_DDRCPCFGR_DDRCPEN);

  /* TODO: check if sr_exit_loop() is needed here */

  return 0;
}

/**
  * @brief  Set hardware self-refresh mode
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t sr_hsr_set(void)
{
  MODIFY_REG(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRCKMOD, RCC_DDRITFCFGR_DDRCKMOD_HSR);

  /*
   * manage quasi-dynamic registers modification
   * hwlpctl.hw_lp_en : Group 2
   */
  if (sw_selfref_entry() != 0)
  {
    return -1;
  }

  start_sw_done();

  WRITE_REG(DDRC->HWLPCTL,
            DDRC_HWLPCTL_HW_LP_EN | DDRC_HWLPCTL_HW_LP_EXIT_IDLE_EN |
            (HW_IDLE_PERIOD << DDRC_HWLPCTL_HW_LP_IDLE_X32_Pos));

  if (wait_sw_done_ack() != 0)
  {
    return -1;
  }

  sw_selfref_exit();

  return 0;
}

/**
  * @brief  Reset DDR sub-system
  * @param  None
  * @retval None
  */
static void ddr_reset(void)
{
  ddr_delay_us(DDR_DELAY_1_US);

#ifdef DDR_INTERACTIVE
  WRITE_REG(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN | RCC_DDRCPCFGR_DDRCPLPEN |
                            RCC_DDRCPCFGR_DDRCPRST);
#endif /* DDR_INTERACTIVE */
  SET_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRRST);
  WRITE_REG(RCC->DDRPHYCAPBCFGR, RCC_DDRPHYCAPBCFGR_DDRPHYCAPBEN |
                                 RCC_DDRPHYCAPBCFGR_DDRPHYCAPBLPEN |
                                 RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST);
  WRITE_REG(RCC->DDRCAPBCFGR, RCC_DDRCAPBCFGR_DDRCAPBEN |
                              RCC_DDRCAPBCFGR_DDRCAPBLPEN |
                              RCC_DDRCAPBCFGR_DDRCAPBRST);
  WRITE_REG(RCC->DDRCFGR, RCC_DDRCFGR_DDRCFGEN | RCC_DDRCFGR_DDRCFGLPEN |
                          RCC_DDRCFGR_DDRCFGRST);

  ddr_delay_us(DDR_DELAY_1_US);

  /* Reset release */
#ifdef DDR_INTERACTIVE
  WRITE_REG(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN | RCC_DDRCPCFGR_DDRCPLPEN);
#endif /* DDR_INTERACTIVE */
  CLEAR_BIT(RCC->DDRPHYCAPBCFGR, RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST);
  CLEAR_BIT(RCC->DDRCAPBCFGR, RCC_DDRCAPBCFGR_DDRCAPBRST);
  CLEAR_BIT(RCC->DDRCFGR, RCC_DDRCFGR_DDRCFGRST);

  ddr_delay_us(DDR_DELAY_1_US);
}

/**
  * @brief  Configure PLL2 dedicated to DDR
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t ddr_pll2_configure(void)
{
#if defined(USE_STM32MP257CXX_EMU)
  __IO uint32_t timeout;

  WRITE_REG(RCC->PLL2CFGR4, RCC_PLL2CFGR4_VAL);
  WRITE_REG(RCC->PLL2CFGR1, RCC_PLL2CFGR1_VAL1);
  WRITE_REG(RCC->PLL2CFGR2, RCC_PLL2CFGR2_VAL);
  WRITE_REG(RCC->PLL2CFGR6, RCC_PLL2CFGR6_VAL);
  WRITE_REG(RCC->PLL2CFGR7, RCC_PLL2CFGR7_VAL);
  WRITE_REG(RCC->PLL2CFGR3, RCC_PLL2CFGR3_VAL);
  WRITE_REG(RCC->PLL2CFGR5, RCC_PLL2CFGR5_VAL);
  WRITE_REG(RCC->PLL2CFGR1, RCC_PLL2CFGR1_VAL2);

  ddr_delay_us(DDR_DELAY_1_US);

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_US_1S);
  while ((READ_REG(DDRDBG->FRAC_PLL_LOCK) & DDRDBG_FRAC_PLL_LOCK_LOCK) !=
         DDRDBG_FRAC_PLL_LOCK_LOCK)
  {
    timeout--;

    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }

    ddr_delay_us(DDR_DELAY_1_US);
  }
#endif /* USE_STM32MP257CXX_EMU */

#if !defined(USE_STM32MP257CXX_EMU)
  RCC_PLLInitTypeDef RCC_Pll2InitStruct = {0};

#ifdef DDR_INTERACTIVE
  RCC_Pll2InitStruct.PLLSource  = static_ddr_config.p_pll.source;
  RCC_Pll2InitStruct.PLLMode    = static_ddr_config.p_pll.mode;
  RCC_Pll2InitStruct.FBDIV      = static_ddr_config.p_pll.fbdiv;
  RCC_Pll2InitStruct.FREFDIV    = static_ddr_config.p_pll.frefdiv;
  RCC_Pll2InitStruct.FRACIN     = static_ddr_config.p_pll.fracin;
  RCC_Pll2InitStruct.POSTDIV1   = static_ddr_config.p_pll.postdiv1;
  RCC_Pll2InitStruct.POSTDIV2   = static_ddr_config.p_pll.postdiv2;
  RCC_Pll2InitStruct.PLLState   = static_ddr_config.p_pll.state;
  RCC_Pll2InitStruct.SSM_Mode   = static_ddr_config.p_pll.ssm_mode;
  RCC_Pll2InitStruct.SSM_SPREAD = static_ddr_config.p_pll.ssm_spread;
  RCC_Pll2InitStruct.SSM_DIVVAL = static_ddr_config.p_pll.ssm_divval;
#else /* DDR_INTERACTIVE */
  RCC_Pll2InitStruct.PLLSource = DDR_PLL_SOURCE;
  RCC_Pll2InitStruct.PLLMode = DDR_PLL_MODE;
  RCC_Pll2InitStruct.FBDIV = DDR_PLL_FBDIV;
  RCC_Pll2InitStruct.FREFDIV = DDR_PLL_FREFDIV;
  RCC_Pll2InitStruct.FRACIN = DDR_PLL_FRACIN;
  RCC_Pll2InitStruct.POSTDIV1 = DDR_PLL_POSTDIV1;
  RCC_Pll2InitStruct.POSTDIV2 = DDR_PLL_POSTDIV2;
  RCC_Pll2InitStruct.PLLState = DDR_PLL_STATE;
  RCC_Pll2InitStruct.SSM_Mode = DDR_PLL_SSM_MODE;
  RCC_Pll2InitStruct.SSM_SPREAD = DDR_PLL_SSM_SPREAD;
  RCC_Pll2InitStruct.SSM_DIVVAL = DDR_PLL_SSM_DIVVAL;
#endif /* DDR_INTERACTIVE */

  if (HAL_RCCEx_PLL2Config(&RCC_Pll2InitStruct) != HAL_OK)
  {
    return -1;
  }
#endif /* !defined(USE_STM32MP257CXX_EMU) */

  return 0;
}

/**
  * @brief  Configure DDR sub-system
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t ddr_sysconf_configuration(void)
{
  if (ddr_pll2_configure() != 0)
  {
    return -1;
  }

#if defined(USE_STM32MP257CXX_EMU)
  WRITE_REG(DDRDBG->LP_DISABLE,
            DDRDBG_LP_DISABLE_LPI_XPI_DISABLE | DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE);
  WRITE_REG(DDRDBG->BYPASS_PCLKEN, 0U);

  ddr_delay_us(DDR_DELAY_1_US);

  WRITE_REG(RCC->DDRPHYCCFGR, RCC_DDRPHYCCFGR_DDRPHYCEN);

  WRITE_REG(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN | RCC_DDRCPCFGR_DDRCPLPEN);
  SET_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRRST);

  ddr_delay_us(DDR_DELAY_1_US);
#endif /* USE_STM32MP257CXX_EMU */

#if !defined(USE_STM32MP257CXX_EMU)
  WRITE_REG(DDRDBG->LP_DISABLE,
            DDRDBG_LP_DISABLE_LPI_XPI_DISABLE | DDRDBG_LP_DISABLE_LPI_DDRC_DISABLE);

  WRITE_REG(DDRDBG->BYPASS_PCLKEN, (uint32_t)static_ddr_config.p_uib.pllbypass[0]);

