STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
  WRITE_REG(RCC->DDRPHYCCFGR, RCC_DDRPHYCCFGR_DDRPHYCEN);
  SET_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRRST);

  ddr_delay_us(DDR_DELAY_1_US);
#endif /* !defined(USE_STM32MP257CXX_EMU) */

  return 0;
}

/**
  * @brief  Wait refresh update done acknowledge
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t wait_refresh_update_done_ack(void)
{
  __IO uint32_t timeout;
  uint32_t rfshctl3;
  uint32_t refresh_update_level = DDRC_RFSHCTL3_REFRESH_UPDATE_LEVEL;

  /* Toggle rfshctl3.refresh_update_level */
  rfshctl3 = READ_REG(DDRC->RFSHCTL3);
  if ((rfshctl3 & refresh_update_level) == refresh_update_level)
  {
    SET_BIT(DDRC->RFSHCTL3, refresh_update_level);
  }
  else
  {
    CLEAR_BIT(DDRC->RFSHCTL3, refresh_update_level);
    refresh_update_level = 0U;
  }

  timeout = ddr_timeout_init_us(DDR_TIMEOUT_US_1S);
  do
  {
    rfshctl3 = READ_REG(DDRC->RFSHCTL3);

    timeout--;
    if (ddr_timeout_elapsed(timeout))
    {
      return -1;
    }
  } while ((rfshctl3 & DDRC_RFSHCTL3_REFRESH_UPDATE_LEVEL) !=
           refresh_update_level);

  return 0;
}

/**
  * @brief  Disable refresh
  * @param  None
  * @retval 0 if success, error code else
  */
static int32_t disable_refresh(void)
{
  SET_BIT(DDRC->RFSHCTL3, DDRC_RFSHCTL3_DIS_AUTO_REFRESH);

  if (wait_refresh_update_done_ack() != 0)
  {
    return -1;
  }

  ddr_delay_us(DDR_DELAY_1_US);

  CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_POWERDOWN_EN |
                          DDRC_PWRCTL_SELFREF_EN);

  ddr_delay_us(DDR_DELAY_1_US);

  /*
   * Manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   */
  if (set_qd3_update_conditions() != 0)
  {
    return -1;
  }

  ddr_delay_us(DDR_DELAY_1_US);

  CLEAR_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_INIT_COMPLETE_EN);

  ddr_delay_us(DDR_DELAY_1_US);

  if (unset_qd3_update_conditions() != 0)
  {
    return -1;
  }

  return 0;
}

/**
  * @brief  Restore refresh
  * @param  rfshctl3 RFSHCTL3 value to restore
  *         pwrctl PWRCTL value to restore
  * @retval 0 if success, error code else
  */
static int32_t restore_refresh(uint32_t rfshctl3, uint32_t pwrctl)
{
  if ((pwrctl & DDRC_PWRCTL_SELFREF_SW) != 0U)
  {
    CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_SW);

    ddr_delay_us(DDR_DELAY_1_US);
  }

  if ((rfshctl3 & DDRC_RFSHCTL3_DIS_AUTO_REFRESH) == 0U)
  {
    CLEAR_BIT(DDRC->RFSHCTL3, DDRC_RFSHCTL3_DIS_AUTO_REFRESH);
    if (wait_refresh_update_done_ack() != 0)
    {
      return -1;
    }

    ddr_delay_us(DDR_DELAY_1_US);
  }

  if ((pwrctl & DDRC_PWRCTL_POWERDOWN_EN) != 0U)
  {
    SET_BIT(DDRC->PWRCTL, DDRC_PWRCTL_POWERDOWN_EN);

    ddr_delay_us(DDR_DELAY_1_US);
  }

  if ((pwrctl & DDRC_PWRCTL_SELFREF_EN) != 0U)
  {
    SET_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_EN);

    ddr_delay_us(DDR_DELAY_1_US);
  }

  /*
   * Manage quasi-dynamic registers modification
   * dfimisc.dfi_init_complete_en : Group 3
   */
  if (set_qd3_update_conditions() != 0)
  {
    return -1;
  }

  ddr_delay_us(DDR_DELAY_1_US);

  SET_BIT(DDRC->DFIMISC, DDRC_DFIMISC_DFI_INIT_COMPLETE_EN);

  ddr_delay_us(DDR_DELAY_1_US);

  if (unset_qd3_update_conditions() != 0)
  {
    return -1;
  }

  return 0;
}

#ifdef DDR_INTERACTIVE
void HAL_DDR_Convert_Case(const char *in_str, char *out_str, bool ToUpper)
{
  while((*out_str = ToUpper? toupper(*in_str) : tolower(*in_str)))
  {
    in_str++;
    out_str++;
  }

  return;
}

static void dump_reg_desc(unsigned long base_addr, const reg_desc_t *desc,
                          bool save)
{
  uintptr_t ptr;
  char reg_name[strlen(desc->name) + 1];
  char output_dest[50] = "";

  if (save)
  {
    if (base_addr == (uint32_t)DDRC_BASE)
    {
      sprintf(output_dest, "#define DDR_%s", desc->name);
    }
    else
    {
      HAL_DDR_Convert_Case(desc->name, reg_name, true); /* convert to upper case */
      sprintf(output_dest, "#define DDR_%s", reg_name);
    }
  }
  else
  {
    HAL_DDR_Convert_Case(desc->name, reg_name, 0); /* convert to lower case */
    sprintf(output_dest, "%s=", reg_name);
  }

  ptr = (uintptr_t)(base_addr + desc->offset);

  if (base_addr == (unsigned long)DDRC_BASE)
  {
    if (save && (strcmp("SWCTL", desc->name) == 0))
    {
      printf("%s 0x00000000\n\r", output_dest);
    }
    else
    {
#ifdef __AARCH64__
      printf("%s 0x%08X\n\r", output_dest, READ_REG(*(volatile uint32_t*)ptr));
#else
      printf("%s 0x%08lX\n\r", output_dest, READ_REG(*(volatile uint32_t*)ptr));
#endif
    }
  }
  else
  {
    printf("%s 0x%08X\n\r", output_dest, *(int *)ptr);
  }
}

static void dump_pll_desc(bool save)
{
  RCC_PLLInitTypeDef PLL2;
  char output_dest[20] = "";

  HAL_RCCEx_GetPLL2Config(&PLL2);

  /*
   * Complete configuration with original settings
   * (not done by HAL_RCCEx_GetPLL2Config).
   * This software never change them.
   */
  PLL2.PLLMode = DDR_PLL_MODE;
  PLL2.SSM_Mode = DDR_PLL_SSM_MODE;
  PLL2.SSM_SPREAD = DDR_PLL_SSM_SPREAD;
  PLL2.SSM_DIVVAL = DDR_PLL_SSM_DIVVAL;

  if (save)
  {
    sprintf(output_dest, "#define DDR_PLL_");
#ifdef __AARCH64__
    printf("%sSOURCE 0x%08X\n\r", output_dest, PLL2.PLLSource);
#else
    printf("%sSOURCE 0x%08lX\n\r", output_dest, PLL2.PLLSource);
#endif
    printf("%sMODE 0x%08X\n\r", output_dest, PLL2.PLLMode);
    printf("%sFBDIV 0x%08X\n\r", output_dest, PLL2.FBDIV);
    printf("%sFREFDIV 0x%08X\n\r", output_dest, PLL2.FREFDIV);
#ifdef __AARCH64__
    printf("%sFRACIN 0x%08X\n\r", output_dest, PLL2.FRACIN);
    printf("%sPOSTDIV1 0x%08X\n\r", output_dest, PLL2.POSTDIV1);
    printf("%sPOSTDIV2 0x%08X\n\r", output_dest, PLL2.POSTDIV2);
#else
    printf("%sFRACIN 0x%08lX\n\r", output_dest, PLL2.FRACIN);
    printf("%sPOSTDIV1 0x%08lX\n\r", output_dest, PLL2.POSTDIV1);
    printf("%sPOSTDIV2 0x%08lX\n\r", output_dest, PLL2.POSTDIV2);
#endif
    printf("%sSTATE 0x%08X\n\r", output_dest, PLL2.PLLState);
#ifdef __AARCH64__
    printf("%sSSM_MODE 0x%08X\n\r", output_dest, PLL2.SSM_Mode);
    printf("%sSSM_SPREAD 0x%08X\n\r", output_dest, PLL2.SSM_SPREAD);
    printf("%sSSM_DIVVAL 0x%08X\n\r", output_dest, PLL2.SSM_DIVVAL);
#else
    printf("%sSSM_MODE 0x%08lX\n\r", output_dest, PLL2.SSM_Mode);
    printf("%sSSM_SPREAD 0x%08lX\n\r", output_dest, PLL2.SSM_SPREAD);
    printf("%sSSM_DIVVAL 0x%08lX\n\r", output_dest, PLL2.SSM_DIVVAL);
#endif
  }
  else
  {
#ifdef __AARCH64__
    printf("source 0x%08X\n\r", PLL2.PLLSource);
#else
    printf("source 0x%08lX\n\r", PLL2.PLLSource);
#endif
    printf("mode 0x%08X\n\r", PLL2.PLLMode);
    printf("fbdiv 0x%08X\n\r", PLL2.FBDIV);
    printf("frefdiv 0x%08X\n\r", PLL2.FREFDIV);
#ifdef __AARCH64__
    printf("fracin 0x%08X\n\r", PLL2.FRACIN);
    printf("postdiv1 0x%08X\n\r", PLL2.POSTDIV1);
    printf("postdiv2 0x%08X\n\r", PLL2.POSTDIV2);
#else
    printf("fracin 0x%08lX\n\r", PLL2.FRACIN);
    printf("postdiv1 0x%08lX\n\r", PLL2.POSTDIV1);
    printf("postdiv2 0x%08lX\n\r", PLL2.POSTDIV2);
#endif
    printf("state 0x%08X\n\r", PLL2.PLLState);
#ifdef __AARCH64__
    printf("ssm_mode 0x%08X\n\r", PLL2.SSM_Mode);
    printf("ssm_spread 0x%08X\n\r", PLL2.SSM_SPREAD);
    printf("ssm_divval 0x%08X\n\r", PLL2.SSM_DIVVAL);
#else
    printf("ssm_mode 0x%08lX\n\r", PLL2.SSM_Mode);
    printf("ssm_spread 0x%08lX\n\r", PLL2.SSM_SPREAD);
    printf("ssm_divval 0x%08lX\n\r", PLL2.SSM_DIVVAL);
#endif
  }
}

