STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
static void dump_param_desc(unsigned long par_addr, const reg_desc_t *desc)
{
  uintptr_t ptr;
  char reg_name[strlen(desc->name) + 1];

  HAL_DDR_Convert_Case(desc->name, reg_name, 0); /* convert to lower case */
  ptr = (uintptr_t)(par_addr + desc->par_offset);
#ifdef __AARCH64__
  printf("%s= 0x%08X\n\r", reg_name, READ_REG(*(volatile uint32_t*)ptr));
#else
  printf("%s= 0x%08lX\n\r", reg_name, READ_REG(*(volatile uint32_t*)ptr));
#endif
}

static const reg_desc_t *found_reg(const char *name, reg_type *type)
{
  unsigned int i, j;
  const reg_desc_t *desc;
  char reg_name[strlen(name) + 1];

  for (i = 0; i < ARRAY_SIZE(ddr_registers); i++)
  {
    desc = ddr_registers[i].desc;
    for (j = 0; j < ddr_registers[i].size; j++)
    {
      /* Compare string lengths to avoid data corruption */
      if (strlen(desc[j].name) > strlen(name))
      {
        continue;
      }

      HAL_DDR_Convert_Case(desc[j].name, reg_name, true); /* convert to upper case */
      if (strcmp(name, reg_name) == 0)
      {
        *type = i;
        return &desc[j];
      }
    }
  }

  *type = REG_TYPE_NB;

  return NULL;
}

static base_type get_filter(const char *name)
{
  char type[strlen(name) + 1];

  HAL_DDR_Convert_Case(name, type, 0); /* convert to lower case */

  if (strcmp(type, base_name[BASE_DDRCTRL]) == 0)
  {
    return BASE_DDRCTRL;
  }
  else if (strcmp(type, base_name[BASE_PHY_UI_BASIC]) == 0)
  {
    return BASE_PHY_UI_BASIC;
  }
  else if (strcmp(type, base_name[BASE_PHY_UI_ADVANCED]) == 0)
  {
    return BASE_PHY_UI_ADVANCED;
  }
  else if (strcmp(type, base_name[BASE_PHY_UI_MODE_REGISTER]) == 0)
  {
    return BASE_PHY_UI_MODE_REGISTER;
  }
  else if (strcmp(type, base_name[BASE_PHY_UI_SWIZZLE]) == 0)
  {
    return BASE_PHY_UI_SWIZZLE;
  }
  else if (strcmp(type, base_name[BASE_DDR_PLL]) == 0)
  {
    return BASE_DDR_PLL;
  }

  return BASE_NONE;
}

HAL_StatusTypeDef HAL_DDR_Dump_Reg(const char *name, bool save)
{
  unsigned int i, j;
  const reg_desc_t *desc;
  unsigned long base_addr;
  base_type p_base;
  reg_type type;
  const char *p_name;
  base_type filter = BASE_NONE;
  HAL_StatusTypeDef result = HAL_ERROR;

  if (save) {
    if (disable_axi_port() != 0) {
      return HAL_ERROR;
    }

    printf("\n/* DDR REG VALUES TO BE SAVED */\n\r");
    printf("#define DDR_MEM_NAME  \"%s\"\n\r", static_ddr_config.info.name);
    printf("#define DDR_MEM_SPEED %d\n\r", (int)static_ddr_config.info.speed);
#ifdef __AARCH64__
    printf("#define DDR_MEM_SIZE  0x%08lx\n\n\r", static_ddr_config.info.size);
#else /* __AARCH64__ */
    printf("#define DDR_MEM_SIZE  0x%08lx\n\n\r", (uint32_t)static_ddr_config.info.size);
#endif /* __AARCH64__ */
  }
  else
  {
    if (name) {
      filter = get_filter(name);
    }
  }

  for (i = 0; i < ARRAY_SIZE(ddr_registers); i++)
  {
    p_base = ddr_registers[i].base;
    p_name = ddr_registers[i].name;
    if (!name || (filter == p_base || !strcmp(name, p_name)) || save)
    {
      result = HAL_OK;
      desc = ddr_registers[i].desc;
      base_addr = (unsigned long)get_base_addr(p_base);

      if (save)
      {
        if (i == REG_DYN)
        {
          printf("\n/* /!\\ No need to copy DDR dynamic registers to conf file */\n\r");
        }
        printf("\n/* %s.%s */\n\r", base_name[p_base], p_name);
      }
      else
      {
        printf("==%s.%s==\n\r", base_name[p_base], p_name);
      }

      if (i == PLL_SETTINGS)
      {
        dump_pll_desc(save);
      }
      else
      {
        for (j = 0; j < ddr_registers[i].size; j++)
        {
          dump_reg_desc(base_addr, &desc[j], save);
        }
      }
    }
  }

  if (result != HAL_OK)
  {
    desc = found_reg(name, &type);
    if (type == PLL_SETTINGS)
    {
      printf("Please read whole pll section content\n\r");
    }
    else if (desc)
    {
      p_base = ddr_registers[type].base;
      base_addr = (unsigned long)get_base_addr(p_base);
      dump_reg_desc(base_addr, desc, false);
      result = HAL_OK;
    }
  }

  if (save) {
    enable_axi_port();
  }

  return result;
}

void HAL_DDR_Edit_Reg(char *name, char *string)
{
  uint32_t value;
  reg_type type;
  const reg_desc_t *desc;
  void *base_addr;
  char *end_ptr;
  char reg_name[strlen(name) + 1];
  char reg_value[strlen(string) + 1];

  HAL_DDR_Convert_Case(name, reg_name, 1); /* convert to upper case */
  HAL_DDR_Convert_Case(string, reg_value, 0); /* convert to lower case */

  desc = found_reg(reg_name, &type);

  if (!desc)
  {
    printf("%s not found\n\r", name);
    return;
  }

  if (type == PLL_SETTINGS)
  {
    printf("Please use 'freq' command to modify PLL settings\n\r");
    return;
  }

  value = (uint32_t)strtoll(reg_value, &end_ptr, 0);
  if (end_ptr == reg_value)
  {
    printf("invalid value %s\n\r", reg_value);
    return;
  }

  base_addr = get_base_addr(ddr_registers[type].base);

  HAL_DDR_Convert_Case(desc->name, reg_name, 0); /* convert to lower case */

  if (base_addr == (void *)DDRC_BASE)
  {
    WRITE_REG(*(volatile uint32_t*)(base_addr + desc->offset), value);

#ifdef __AARCH64__
    printf("%s= 0x%08X\n\r", reg_name,
           READ_REG(*(volatile uint32_t*)(base_addr + desc->offset)));
#else
    printf("%s= 0x%08lX\n\r", reg_name,
           READ_REG(*(volatile uint32_t*)(base_addr + desc->offset)));
#endif
  }
  else
  {
    *(int *)(base_addr + desc->offset) = value;

    printf("%s= 0x%08X\n\r", reg_name, *(int *)(base_addr + desc->offset));
  }
}

static unsigned long get_par_addr(HAL_DDR_ConfigTypeDef *config, reg_type type)
{
  uint32_t par_addr = 0x0;

  switch (type)
  {
  case REG_REG:
    par_addr = (unsigned long)&config->c_reg;
    break;
  case REG_TIMING:
    par_addr = (unsigned long)&config->c_timing;
    break;
  case REG_MAP:
    par_addr = (unsigned long)&config->c_map;
    break;
  case REG_PERF:
    par_addr = (unsigned long)&config->c_perf;
    break;
  case PHY_UI_BASIC:
    par_addr = (unsigned long)&config->p_uib;
    break;
  case PHY_UI_ADVANCED:
    par_addr = (unsigned long)&config->p_uia;
    break;
  case PHY_UI_MODE_REGISTER:
    par_addr = (unsigned long)&config->p_uim;
    break;
  case PHY_UI_SWIZZLE:
    par_addr = (unsigned long)&config->p_uis;
    break;
  case PLL_SETTINGS:
    par_addr = (unsigned long)&config->p_pll;
    break;
  case REG_DYN:
  case REG_TYPE_NB:
    par_addr = (unsigned long)NULL;
    break;
  }

  return par_addr;
}

HAL_StatusTypeDef HAL_DDR_Dump_Param(HAL_DDR_ConfigTypeDef *config,
                                     const char *name)
{
  unsigned int i, j;
  const reg_desc_t *desc;
  unsigned long par_addr;
  base_type p_base;
  reg_type type;
  const char *p_name;
  base_type filter = BASE_NONE;
  HAL_StatusTypeDef result = HAL_ERROR;

  if (name) {
    filter = get_filter(name);
  }

  for (i = 0; i < ARRAY_SIZE(ddr_registers); i++)
  {
    par_addr = get_par_addr(config, i);
    if (!par_addr)
    {
      continue;
    }

    p_base = ddr_registers[i].base;
    p_name = ddr_registers[i].name;
    if (!name || (filter == p_base || !strcmp(name, p_name)))
    {
      result = HAL_OK;
      desc = ddr_registers[i].desc;
      printf("==%s.%s==\n\r\n\r", base_name[p_base], p_name);
      for (j = 0; j < ddr_registers[i].size; j++)
      {
        dump_param_desc(par_addr, &desc[j]);
      }
    }
  }

  if (result != HAL_OK)
  {
    desc = found_reg(name, &type);
    if (desc)
    {
      par_addr = get_par_addr(config, type);
      if (par_addr)
      {
        dump_param_desc(par_addr, desc);
        result = HAL_OK;
      }
    }
  }
  return result;
}

