STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
void HAL_DDR_Edit_Param(HAL_DDR_ConfigTypeDef *config, char *name,
                        char *string)
{
  uintptr_t ptr;
  uint32_t value;
  reg_type type;
  const reg_desc_t *desc;
  unsigned long par_addr;
  char *end_ptr;

  desc = found_reg(name, &type);
  if (!desc)
  {
    printf("%s not found\n\r", name);
    return;
  }

  value = (uint32_t)strtoll(string, &end_ptr, 0);
  if (end_ptr == string)
  {
    printf("invalid value %s\n\r", string);
    return;
  }

  par_addr = get_par_addr(config, type);
  if (!par_addr) {
    printf("no parameter %s\n\r", name);
    return;
  }

  ptr = (uintptr_t)(par_addr + desc->par_offset);
  WRITE_REG(*(volatile uint32_t*)ptr, value);

  {
    char reg_name[strlen(desc->name) + 1];

    HAL_DDR_Convert_Case(desc->name, reg_name, 0); /* convert to lower case */
#ifdef __AARCH64__
    printf("%s= 0x%08X\n\r", reg_name, READ_REG(*(volatile uint32_t*)ptr));
#else
    printf("%s= 0x%08lX\n\r", reg_name, READ_REG(*(volatile uint32_t*)ptr));
#endif
  }
}

__weak bool HAL_DDR_Interactive(__attribute__((unused))HAL_DDR_InteractStepTypeDef step)
{
  return false;
}

#define INTERACTIVE(step) HAL_DDR_Interactive(step)
#endif /* DDR_INTERACTIVE */

/* Exported functions ---------------------------------------------------------*/

/** @defgroup DDR_Exported_Functions DDR Exported Functions
  * @{
  */


/**
  * @brief  DDR init sequence, including
  *         - reset/clock/power management (i.e. access to other IPs),
  *         - DDRCTRL and DDRPHY configuration and initialization,
  *         - self-refresh mode setup,
  *         - data/addr tests execution after training.
  * @param  DDR initialisation structure
  * @retval None.
  */
HAL_StatusTypeDef HAL_DDR_Init(DDR_InitTypeDef *iddr)
{
  int32_t iret  = -1;
  uint32_t uret;
  uint32_t ddr_retdis;
  HAL_DDR_SelfRefreshModeTypeDef mode;

  iddr->self_refresh = false;

  if (iddr->wakeup_from_standby)
  {
    iddr->self_refresh = true;
  }

#ifdef STM32MP_GATHER_DDRCTRL_SETTING_IN_STATIC_ARRAY
  {
    uint32_t *ptr_src;
    uint32_t *ptr_dest;
    uint32_t j;
    uint32_t start = 0U;
    uint32_t end = 0U;

    ptr_src = (uint32_t *)&tab_static_param[0];
    ptr_dest = &static_ddr_config.c_reg.MSTR;
    end += ARRAY_SIZE(ddr_reg_desc);

    for (j = start; j < end; j++)
    {
      *ptr_dest = *ptr_src;
      ptr_dest++;
      ptr_src++;
    }

    ptr_dest = &static_ddr_config.c_timing.RFSHTMG;
    start = end;
    end += ARRAY_SIZE(ddr_timing_desc);

    for (j = start; j < end; j++)
    {
      *ptr_dest = *ptr_src;
      ptr_dest++;
      ptr_src++;
    }

    ptr_dest = &static_ddr_config.c_map.ADDRMAP0;
    start = end;
    end += ARRAY_SIZE(ddr_map_desc);


    for (j = start; j < end; j++)
    {
      *ptr_dest = *ptr_src;
      ptr_dest++;
      ptr_src++;
    }

    ptr_dest = &static_ddr_config.c_perf.SCHED;
    start = end;
    end += ARRAY_SIZE(ddr_perf_desc);


    for (j = start; j < end; j++)
    {
      *ptr_dest = *ptr_src;
      ptr_dest++;
      ptr_src++;
    }

    static_ddr_config.p_uia.phymstrtraininterval[0] =
            tab_static_param[ARRAY_SIZE(tab_static_param) - 1];
  }
#endif /* STM32MP_GATHER_DDRCTRL_SETTING_IN_STATIC_ARRAY */

  if ((static_ddr_config.c_reg.MSTR & DDRC_MSTR_DDR3) != 0U)
  {
    iret = HAL_DDR_MspInit(STM32MP_DDR3);
  }
  else if ((static_ddr_config.c_reg.MSTR & DDRC_MSTR_DDR4) != 0U)
  {
    iret = HAL_DDR_MspInit(STM32MP_DDR4);
  }
  else if ((static_ddr_config.c_reg.MSTR & DDRC_MSTR_LPDDR4) != 0U)
  {
    iret = HAL_DDR_MspInit(STM32MP_LPDDR4);
  }

  if (iret != 0)
  {
    return HAL_ERROR;
  }

  /* Check DDR PHY pads retention */
  ddr_retdis = READ_REG(PWR->CR11) & PWR_CR11_DDRRETDIS;
  if (iddr->self_refresh)
  {
    if (ddr_retdis == PWR_CR11_DDRRETDIS)
    {
      iddr->self_refresh = false;
    }
  }

  if (!iddr->self_refresh)
  {
    SET_BIT(PWR->CR11, PWR_CR11_DDRRETDIS);
  }

#ifdef DDR_INTERACTIVE
start:
#endif /* DDR_INTERACTIVE */

  if (iddr->wakeup_from_standby)
  {
    WRITE_REG(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN | RCC_DDRCPCFGR_DDRCPLPEN |
                              RCC_DDRCPCFGR_DDRCPRST);
    SET_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRRST);
    WRITE_REG(RCC->DDRPHYCAPBCFGR, RCC_DDRPHYCAPBCFGR_DDRPHYCAPBEN |
                                   RCC_DDRPHYCAPBCFGR_DDRPHYCAPBLPEN |
                                   RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST);
    WRITE_REG(RCC->DDRCAPBCFGR, RCC_DDRCAPBCFGR_DDRCAPBEN |
                                RCC_DDRCAPBCFGR_DDRCAPBLPEN |
                                RCC_DDRCAPBCFGR_DDRCAPBRST);

    CLEAR_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRPHYDLP);
    SET_BIT(RCC->DDRPHYCCFGR, RCC_DDRPHYCCFGR_DDRPHYCEN);

    ddr_delay_us(DDR_DELAY_1_US);

    /* Disable IO retention */
    SET_BIT(PWR->CR11, PWR_CR11_DDRRETDIS);

    ddr_delay_us(DDR_DELAY_1_US);
    CLEAR_BIT(RCC->DDRCAPBCFGR, RCC_DDRCAPBCFGR_DDRCAPBRST);
    ddr_delay_us(DDR_DELAY_1_US);

    if (ddr_pll2_configure() != 0)
    {
      return HAL_ERROR;
    }
  }
  else
  {
    ddr_reset();

#ifdef DDR_INTERACTIVE
    if (INTERACTIVE(STEP_DDR_RESET))
    {
      goto start;
    }
#endif /* DDR_INTERACTIVE */

    if (ddr_sysconf_configuration() != 0)
    {
      return HAL_ERROR;
    }
  }

#if STM32MP_LPDDR4_TYPE
  /*
   * Enable PWRCTL.SELFREF_SW to ensure correct setting of PWRCTL.LPDDR4_SR_ALLOWED.
   * Later disabled in restore_refresh().
   */
  static_ddr_config.c_reg.PWRCTL |= DDRC_PWRCTL_SELFREF_SW;
#endif /* STM32MP_LPDDR4_TYPE */

  if ((set_reg(REG_REG, (uintptr_t)&static_ddr_config.c_reg) != 0) ||
      (set_reg(REG_TIMING, (uintptr_t)&static_ddr_config.c_timing) != 0) ||
      (set_reg(REG_MAP, (uintptr_t)&static_ddr_config.c_map) != 0) ||
      (set_reg(REG_PERF, (uintptr_t)&static_ddr_config.c_perf) != 0))
  {
    return HAL_ERROR;
  }

#ifdef DDR_INTERACTIVE
  if (INTERACTIVE(STEP_CTL_INIT))
  {
    goto start;
  }
#endif /* DDR_INTERACTIVE */

  if (!iddr->wakeup_from_standby)
  {
    /* DDR core and PHY reset de-assert */
    CLEAR_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRRST);

