STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
    if (disable_refresh() != 0)
    {
      return HAL_ERROR;
    }
  }

  if ((set_reg(PHY_UI_BASIC, (uintptr_t)&static_ddr_config.p_uib) != 0) ||
      (set_reg(PHY_UI_ADVANCED, (uintptr_t)&static_ddr_config.p_uia) != 0) ||
      (set_reg(PHY_UI_MODE_REGISTER, (uintptr_t)&static_ddr_config.p_uim) != 0) ||
      (set_reg(PHY_UI_SWIZZLE, (uintptr_t)&static_ddr_config.p_uis) != 0))
  {
    return HAL_ERROR;
  }

  if (iddr->wakeup_from_standby)
  {
    WRITE_REG(RCC->DDRCPCFGR, RCC_DDRCPCFGR_DDRCPEN | RCC_DDRCPCFGR_DDRCPLPEN);
    CLEAR_BIT(RCC->DDRITFCFGR, RCC_DDRITFCFGR_DDRRST);
    CLEAR_BIT(RCC->DDRPHYCAPBCFGR, RCC_DDRPHYCAPBCFGR_DDRPHYCAPBRST);
    WRITE_REG(RCC->DDRCFGR, RCC_DDRCFGR_DDRCFGEN | RCC_DDRCFGR_DDRCFGLPEN);

    /* Initialize DDR by skipping training and disabling result saving */
    iret = ddrphy_phyinit_sequence(true, false);

    if (iret == 0)
    {
      iret = ddrphy_phyinit_restore_sequence();
    }

    /* Poll on ddrphy_initeng0_phyinlpx.phyinlp3 = 0 */
    if (wait_lp3_mode(false) != 0)
    {
      return HAL_ERROR;
    }
  }
  else
  {
#ifdef STM32MP_DISABLE_SAVE_RETENTION_REGISTERS
    /*
     * Initialize DDR including training but without result saving.
     * In a M33 DDR_Starter context executed in RETRAM, this is mandatory
     * to ensure a good execution without conflict with log buffer.
     */
    iret = ddrphy_phyinit_sequence(false, false);
#else /* STM32MP_DISABLE_SAVE_RETENTION_REGISTERS */
    /* Initialize DDR including training and result saving */
    iret = ddrphy_phyinit_sequence(false, true);
#endif /* STM32MP_DISABLE_SAVE_RETENTION_REGISTERS */
  }

  if (iret != 0)
  {
    return HAL_ERROR;
  }

#ifdef DDR_INTERACTIVE
  if (INTERACTIVE(STEP_PHY_INIT))
  {
    goto start;
  }
#endif /* DDR_INTERACTIVE */

  if (activate_controller(false) != 0)
  {
    return HAL_ERROR;
  }

  if (iddr->wakeup_from_standby)
  {
    /* SW self refresh entry prequested */
    CLEAR_BIT(DDRC->PWRCTL, DDRC_PWRCTL_SELFREF_SW);

    if (sr_exit_loop() != 0)
    {
      return HAL_ERROR;
    }

    /* Re-enable DFI low-power interface */
    SET_BIT(DDRC->DFILPCFG0, DDRC_DFILPCFG0_DFI_LP_EN_SR);
  }
  else
  {
    /* Set back registers in step 8 to the orginal values if desidered */
    if (restore_refresh(static_ddr_config.c_reg.RFSHCTL3,
                        static_ddr_config.c_reg.PWRCTL) != 0)
    {
      return HAL_ERROR;
    }
  }

  enable_axi_port();

#ifdef DDR_INTERACTIVE
  if (INTERACTIVE(STEP_DDR_READY))
  {
    goto start;
  }
#endif /* DDR_INTERACTIVE */

  /* Checking DDR access is only applicable, if current core is TDCID */
  /* according to default RISAF4 configuration */
  uret = 0U;
#if defined(CORE_CA35)
  if (RIMC_CR_TDCID1 == (RIMC->CR&RIMC_CR_TDCID_Msk))
  {
    uret = 1U;
  }
  else
  {
    /* WARNING:   DDR access tests bypassed - A35 core not TDCID ! */
  }
#elif defined(CORE_CM33)
  if (RIMC_CR_TDCID2 == (RIMC->CR&RIMC_CR_TDCID_Msk))
  {
    uret = 1U;
  }
  else
  {
    /* WARNING:   DDR access tests bypassed - M33 core not TDCID ! */
  }
#endif /* defined(CORE_CM33) */

  if (uret == 1U)
  {
    uintptr_t ulret;

    if (iddr->self_refresh)
    {
      ulret = ddr_test_rw_access();
      if (ulret != 0UL)
      {
        return HAL_ERROR;
      }
    }
    else
    {
      ulret = ddr_test_data_bus();
      if (ulret != 0U)
      {
        return HAL_ERROR;
      }

      ulret = ddr_test_addr_bus();
      if (ulret != 0UL)
      {
        return HAL_ERROR;
      }

      ulret = ddr_check_size();
      if (ulret != static_ddr_config.info.size)
      {
        return HAL_ERROR;
      }
    }
  }

  /*
   * Initialization sequence has configured DDR registers with settings.
   * Get Self Refresh (SR) mode stored in settings (pwrctl value), reset
   * sr_mode global variable and set this mode.
   */
  mode = HAL_DDR_SR_ReadMode();
  sr_mode = HAL_DDR_INVALID_MODE;

  return HAL_DDR_SR_SetMode(mode);
}

/**
  * @brief  Enable DDR Self-Refresh, when entering in CSTOP.
  * @param  zq0cr0_zdata IO calibration value.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_Entry(__unused uint32_t *zq0cr0_zdata)
{
  HAL_StatusTypeDef ret = HAL_ERROR;

  switch (sr_mode)
  {
    case HAL_DDR_SW_SELF_REFRESH_MODE:
      if (sr_ssr_entry() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_AUTO_SELF_REFRESH_MODE:
      if (sr_asr_entry() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_HW_SELF_REFRESH_MODE:
      if (sr_hsr_entry() == 0)
      {
        ret = HAL_OK;
      }
      break;
    default:
      break;
  }

  return ret;
}

/**
  * @brief  Enable DDR Self-Refresh, when entering in CSTANBY (shutting down).
  * @param  none.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_STDBY_SR_Entry(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;

  switch (sr_mode)
  {
    case HAL_DDR_SW_SELF_REFRESH_MODE:
      if (stdby_sr_ssr_entry() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_AUTO_SELF_REFRESH_MODE:
      if (stdby_sr_asr_entry() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_HW_SELF_REFRESH_MODE:
      if (stdby_sr_hsr_entry() == 0)
      {
        ret = HAL_OK;
      }
      break;
    default:
      break;
  }

  return ret;
}

/**
  * @brief  Remove DDR Self-Refresh on low power cases (when exiting from
  *         CSTOP).
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_Exit(void)
{
  HAL_StatusTypeDef ret = HAL_ERROR;

  switch (sr_mode)
  {
    case HAL_DDR_SW_SELF_REFRESH_MODE:
      if (sr_ssr_exit() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_AUTO_SELF_REFRESH_MODE:
      if (sr_asr_exit() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_HW_SELF_REFRESH_MODE:
      if (sr_hsr_exit() == 0)
      {
        ret = HAL_OK;
      }
      break;
    default:
      break;
  }

  return ret;
}

/**
  * @brief  Activate either HW, or SW or automatic self-refresh, in low power
  *         cases (when entering in or exiting from CSTOP).
  * @param  mode Self-refresh mode.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SR_SetMode(HAL_DDR_SelfRefreshModeTypeDef mode)
{
  HAL_StatusTypeDef ret = HAL_ERROR;

