STMicroelectronics/STM32DDRFW-UTIL/Drivers/STM32MP2xx_HAL_Driver/Src/stm32mp2xx_hal_ddr.c
  if (mode == sr_mode)
  {
    return HAL_OK;
  }

  switch (mode)
  {
    case HAL_DDR_SW_SELF_REFRESH_MODE:
      if (sr_ssr_set() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_AUTO_SELF_REFRESH_MODE:
      if (sr_asr_set() == 0)
      {
        ret = HAL_OK;
      }
      break;
    case HAL_DDR_HW_SELF_REFRESH_MODE:
      if (sr_hsr_set() == 0)
      {
        ret = HAL_OK;
      }
      break;
    default:
      break;
  }

  if (ret == HAL_OK)
  {
    sr_mode = mode;
  }

  return ret;
}

/**
  * @brief  Read current self-refresh mode, in low power
  *         cases (when entering in or exiting from CSTOP).
  * @retval Self-refresh mode.
  */
HAL_DDR_SelfRefreshModeTypeDef HAL_DDR_SR_ReadMode(void)
{
  uint32_t pwrctl = READ_REG(DDRC->PWRCTL);

  switch (pwrctl & (DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE |
                    DDRC_PWRCTL_SELFREF_EN))
  {
    case 0U:
      sr_mode = HAL_DDR_SW_SELF_REFRESH_MODE;
      break;
    case DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE:
      sr_mode = HAL_DDR_HW_SELF_REFRESH_MODE;
      break;
    case DDRC_PWRCTL_EN_DFI_DRAM_CLK_DISABLE | DDRC_PWRCTL_SELFREF_EN:
      sr_mode = HAL_DDR_AUTO_SELF_REFRESH_MODE;
      break;
    default:
      sr_mode = HAL_DDR_INVALID_MODE;
      break;
  }

  return sr_mode;
}

/**
  * @brief  Update retention register save area address.
  *         A default value is defined (last RETRAM 2KB).
  *         Must be used before first HAL_DDR_Init call.
  * @param  base new address.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_DDR_SetRetentionAreaBase(uint64_t base)
{
  if(ddrphy_phyinit_setretreglistbase(base) != 0)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */
#endif /* DDRC & DDRPHYC */
#endif /* HAL_DDR_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
